[
    {
        "title": "Senior Application Software Engineer (Core Systems)",
        "company_name": "Corporate",
        "location": "Missouri",
        "via": "via Centene - Centene Corporation",
        "description": "You could be the one who changes everything for our 26 million members by using technology to improve health outcomes around the world. As a diversified, national organization, Centene's technology professionals have access to competitive benefits including a fresh perspective on workplace flexibility.\n\nPosition Purpose: Design, build, test and maintain scalable and stable off the shelf... application or custom built technology solutions to meet business needs. Act as a subject matter expert for Application Software developers and Engineers.\n\n• Contribute to the entire implementation process including driving the definition of improvements based on business need and architectural improvements\n• Meet with business partners to understand business needs\n• Responsible for overall design of the solution\n• Design, build and test applications\n• Conduct root cause analysis and advanced performance tuning for complex business processes and functionality\n\nEducation/Experience: Bachelor's degree in Computer Science, MIS, related field or equivalent experience. 3+ years of related experience. Healthcare experience strongly preferred, requires demonstrated understanding of business process as it relates to experience in the field. (a) Strong working knowledge of COBOL, JAVA, JSP, Supertool, PL/SQL, UNIX shell scripting, etc. Amisys, Facets or other claims management system experience a plus. (b) Strong working knowledge of Java Script, OOP/OOAD, XML, HTML, ASP.Net, C#. Experience with Oracle or SQL Server. Experience with web services, messaging, and stored procedures.\n\nOur Comprehensive Benefits Package: Flexible work solutions including remote options, hybrid work schedules and dress flexibility, Competitive pay, Paid time off including holidays, Health insurance coverage for you and your dependents, 401(k) and stock purchase plans, Tuition reimbursement and best-in-class training and development.\n\nCentene is an equal opportunity employer that is committed to diversity, and values the ways in which we are different. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or other characteristic protected by applicable law",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Education/Experience: Bachelor's degree in Computer Science, MIS, related field or equivalent experience",
                    "3+ years of related experience",
                    "(a) Strong working knowledge of COBOL, JAVA, JSP, Supertool, PL/SQL, UNIX shell scripting, etc",
                    "(b) Strong working knowledge of Java Script, OOP/OOAD, XML, HTML, ASP.Net, C#",
                    "Experience with Oracle or SQL Server",
                    "Experience with web services, messaging, and stored procedures"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Position Purpose: Design, build, test and maintain scalable and stable off the shelf application or custom built technology solutions to meet business needs",
                    "Act as a subject matter expert for Application Software developers and Engineers",
                    "Contribute to the entire implementation process including driving the definition of improvements based on business need and architectural improvements",
                    "Meet with business partners to understand business needs",
                    "Responsible for overall design of the solution",
                    "Conduct root cause analysis and advanced performance tuning for complex business processes and functionality"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Our Comprehensive Benefits Package: Flexible work solutions including remote options, hybrid work schedules and dress flexibility, Competitive pay, Paid time off including holidays, Health insurance coverage for you and your dependents, 401(k) and stock purchase plans, Tuition reimbursement and best-in-class training and development"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Corporate&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCM0J",
                "text": "See web results for Corporate"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSDS5aKwajwln1eIbfiByOv9QArTMtv_aTLJZJihU4&s",
        "extensions": [
            "3 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgQXBwbGljYXRpb24gU29mdHdhcmUgRW5naW5lZXIgKENvcmUgU3lzdGVtcykiLCJodGlkb2NpZCI6Ik5IVFVtV0NOVE1NQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVVOUWQycHFVa0oyZG5Nek4yVjFaMGRLYlZwdmFtbzJjMUZXVEVWeWVqVkRUMEkzZVV4eWJXaFpibmxtZFd0Q1VtMUNla3RoVmtzME5FMDNXSE0zTldacllUVkxNMUpHZDI5M1Z6WndlV05xVjBKbFpWQXhSVzVpU0hZeE9HSk9UWE5pTTNkd1VFMWlNVW8xTVhCcmRuZGpWMjFQUWkxaFFqaHZkbFY2YzJscGRpMUdNbkZaTkdGdGJWaE9jelJ1TUdSeE1uWnZiblJ0U0ZWWFh6RmhNVWN4Umt0V2RuZG1UemhhTkdOMllVVk9jblJoVlhjek1FMVJRMVJ2WW1Gb2JIUjVObTFPVGtNMGJFcGtFaGMxV210UFdrOW1ORkJLUTBkM1ltdFFNazl0UVMxQk9Cb2lRVVpmTmsxQlVEWnlhR1puVFc5RFRHTmhXREJ3TmxndGJsWnZObFJoVG5NelFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiIubkZnMmVie2ZvbnQtd2VpZ2h0OjUwMH0uQmk2RGRje2ZvbnQtd2VpZ2h0OjUwMH1BcHBseSBkaXJlY3RseSBvbiBDZW50ZW5lIC0gQ2VudGVuZSBDb3Jwb3JhdGlvbiIsImxpbmsiOiJodHRwczovL2pvYnMuY2VudGVuZS5jb20vdXMvZW4vam9iLzE0MDg0MzUvU2VuaW9yLUFwcGxpY2F0aW9uLVNvZnR3YXJlLUVuZ2luZWVyLUNvcmUtU3lzdGVtcz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineering Manager II, Google Cloud Performance",
        "company_name": "Google",
        "location": "United States",
        "via": "via Google Careers",
        "description": "Like Google's own ambitions, the work of a Software Engineer (SWE) goes way beyond just Search. SWE Managers have not only the technical expertise to take on and provide technical leadership to major projects, but also manage a team of engineers. You not only optimize your own code but make sure engineers are able to optimize theirs. As a SWE Manager you manage your project goals, contribute to... product strategy and help develop your team. SWE teams work all across the company, in areas such as information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, user interface design; the list goes on and is growing every day. Operating with scale and speed, our exceptional software engineers are just getting started -- and as a manager, you guide the way.\n\nGoogle Cloud accelerates organizations’ ability to digitally transform their business with the best infrastructure, platform, industry solutions and expertise. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology – all on the cleanest cloud in the industry. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.\n\nThe US base salary range for this full-time position is $174,000-$276,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google",
        "job_highlights": [
            {
                "title": "Responsibilities",
                "items": [
                    "You not only optimize your own code but make sure engineers are able to optimize theirs",
                    "As a SWE Manager you manage your project goals, contribute to product strategy and help develop your team"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "The US base salary range for this full-time position is $174,000-$276,000 + bonus + equity + benefits",
                    "Our salary ranges are determined by role, level, and location"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.google.com/",
                "text": "google.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Google&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCIsK",
                "text": "See web results for Google"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSU_POIuBNOEuOLob3qd0dMQ8uPa8wiMThfRtBfa5c&s",
        "extensions": [
            "2 days ago",
            "Full-time",
            "Health insurance"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlcmluZyBNYW5hZ2VyIElJLCBHb29nbGUgQ2xvdWQgUGVyZm9ybWFuY2UiLCJodGlkb2NpZCI6ImNoRzREQ0dDRHNvQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVVOUWQycHFVV05TZGpaVE9HRmlaM2hqVWxaUGRWcG9NR0pIUVZWRGRVWkpiVXBvWkZvNGMwWllTVjlLTnpWUlpFRm5jM1JHYzJKcVZteEdkWFZTTkU5aVJWcHpUa2t6U1RsWFlqTjFRM2hSVEcxbmRHRlJSRmQwY1Vad1dXOVRiRmh1U1hwamJVZGtjVFowTVdGT2IxVjVkMm8zYzBKVWNYcGxRWFZhVTJoeGVEbE5kVFpqWDBsRWQzZ3libGR1UjFvMU9EWnVORzl0VTFWQlMydDRkM0YyY1ZKNWNUQkRhM0Y0Y0hwUWRsb3piRnBxWVRWTlZESkJWMmRtUmxOUE1VcEVXV2RYUTJoRGJYcFpaRVZaU0RGQ2ExaDNVSHBKVEZadUxURlBSSHBmVVJJWE5WcHJUMXBQWmpSUVNrTkhkMkpyVURKUGJVRXRRVGdhSWtGR1h6Wk5RVTl3UWtaaWJrVXpTMnd3VWt0SlZXVktlVzVzVVMwMWJ5MXVUbWMiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18yIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIEdvb2dsZSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy5nb29nbGUuY29tL2pvYnMvcmVzdWx0cy83NTc1Mzk2NzYyOTI3OTk0Mi8/Y29tcGFueT1Hb29nbGVcdTAwMjZjb21wYW55PVlvdVR1YmVcdTAwMjZlbXBsb3ltZW50X3R5cGU9RlVMTF9USU1FXHUwMDI2amxvXHUwMDI2cGFnZT0yMVx1MDAyNnFcdTAwMjZzb3J0X2J5PXJlbGV2YW5jZVx1MDAyNnV0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Software Engineer",
        "company_name": "Citadel",
        "location": "United States",
        "via": "via Citadel",
        "description": "At Citadel, Software Engineers are responsible for building the systems that power every aspect of our investment process, from research and analysis to trading, risk management, funding and settlement. Working side by side with investors and quantitative researchers, we use our technical skills to drive critical commercial outcomes. If you’re interested in financial markets and excited by the... prospect of having real impact in a fast-paced environment where everyone is inspired to be their best, we’re excited to meet you.\n\nOur most successful engineers are critical thinkers who know how to dissect the problem as proficiently as they know how to build the solution. While we look for technical acumen, commercial acumen is just as important. That includes the ability to flex, change course, and iterate without always having pre-defined specs.\n\nYOUR OPPORTUNITY:\nFrom system engineers who create next-gen platforms to desk-aligned developers who partner with investment teams to increase efficiency and maximize returns, our engineering opportunities are as varied as they are challenging. If you are selected for an interview, one of our recruiters will be in touch to review the specific roles, teams and regions that best align with your skills, seniority, and experience.\n\nYOUR SKILLS & TALENTS:\n• 6+ years of professional software engineering experience\n• Solid computer science fundamentals\n• Expert level programing skills in at least one of the following: Java, C++, Python\n• Proven track record in software design and development\n• Excellent analysis / problem solving skills\n• Strong communication and teamwork skills\n• Ability to manage multiple tasks in a demanding and dynamic environment\n• Minimum of a Bachelor’s degree in Computer Science or a related STEM discipline\n\nIn accordance with New York City’s Pay Transparency Law, the base salary range for this role is $150,000 to $300,000. Base salary does not include other forms of compensation or benefits",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "6+ years of professional software engineering experience",
                    "Solid computer science fundamentals",
                    "Expert level programing skills in at least one of the following: Java, C++, Python",
                    "Proven track record in software design and development",
                    "Excellent analysis / problem solving skills",
                    "Strong communication and teamwork skills",
                    "Ability to manage multiple tasks in a demanding and dynamic environment",
                    "Minimum of a Bachelor’s degree in Computer Science or a related STEM discipline"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Base salary does not include other forms of compensation or benefits"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.citadel.com/",
                "text": "citadel.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Citadel&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCMsK",
                "text": "See web results for Citadel"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-NpKMlXwyH2YS29sH83vAI4cShUzG7IvScfWI&s=0",
        "extensions": [
            "2 days ago",
            "Full-time",
            "Health insurance"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiNkttQWZzXzhCazhBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVU5RZDJwcVUyMWFVVU5RY2treGJtaGpSV3hyVkdwRWJHOXRXSFIxTVd0a2MzQnpORnB4ZG1zMlNFZE9VekpWU1hsU1NXWXlZVTlvUjBjeFVsRlFSRFl3WW1wYVZuVk9aek5tTVRSRmRHVXRVRUZTTlRoM1VXMHdRV1pET1VJd2QxRllTMk54TnpKemJYZE1WVkpFV1ZCQ2VVdHNXSFJNZWtkUk56Rk5OVmhxYjBwRWNrVTRRV0pJVWpZeVFtNHRXR3RUTlRoZmEybGpRWE5HUW04ek1XbFJFaGMxV210UFdrOW1ORkJLUTBkM1ltdFFNazl0UVMxQk9Cb2lRVVpmTmsxQlRYVjRTRFI0YVdoWlJGRXlUbEpmZVhaNU5qVmpRVTVMTUdGaWR3IiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBDaXRhZGVsIiwibGluayI6Imh0dHBzOi8vd3d3LmNpdGFkZWwuY29tL2NhcmVlcnMvZGV0YWlscy9zb2Z0d2FyZS1lbmdpbmVlci8/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Senior Software Engineer - Data",
        "company_name": "Democracy Works",
        "location": "Anywhere",
        "via": "via Democracy Jobs",
        "description": "Location: Remote within the US\n\nAbout our organization...\n\nAt Democracy Works, we help Americans vote, no matter what! Our vision is to make voting a simple, seamless experience for all Americans so that no one misses an election, and our team works to help make this happen. Democracy Works is committed to diversity and inclusion in everything we do and aspires to have a team that's representative of the voters we serve.\n• Level: Senior\n• Supervisory role: N\n\nSalary Range:\n• Most regions in the United States: $118,800 - $125,400\n• California-specific: $118,800 - $136,000\n• NYC-specific: $132,000 - $136,000\n\nOffers will vary based on experience and location-based cost-of-living calculations.\n\nThe impact you’ll make:\n\nOur teams work closely together to build the next generation of tools for both voters and election administrators. Our suite of tools include TurboVote, the Voting Information Project (VIP), and How To Vote. To power these tools we use a variety of languages such as: JavaScript, TypeScript, Python, Ruby, Clojure. We employ a microservices architecture and run our applications in AWS. We are evolving our program offerings to deliver new experiences that increase our organization’s impact on voters and election administrators.\n\nAs a Senior Software Engineer - Data on the team, you will:\n• Build data pipelines to ingest data from across the organization to enable data analysis\n• Enrich data sets with internal and external data sources to drive decision making and demonstrating our organization’s impact\n• Implement large-scale technical decisions that have multi-year impact such as choices of new framework, language, or vendors\n• Serve as a subject-matter expert in the data and software engineering space and act as a go-to resource for thought partnership\n• Provide technical mentorship to members of your team\n• Execute other tasks as may be assigned\n\nYou are someone with:\n• 5+ years of hands-on experience delivering technical projects using a functional, object-oriented or scripting programming language\n• An understanding of structured and unstructured data and data modeling techniques\n• Knowledge of SQL including schema design, query optimization, and migration of data to new schemas over time.\n• A strong background in at least one programming language such as Python, R, Java, JavaScript, etc.\n• Experience working with data warehouse/lake technologies like Amazon Redshift or Snowflake\n• Experience analyzing raw data, developing and maintaining datasets, and improving data quality and efficiency\n\nIt’s a plus if:\n• You have experience with or an understanding of geospatial databases or spatial relational database extensions\n• You have experience with or an understanding of geospatial software such as ArcGIS or QGIS\n• You have a knowledge of machine learning techniques for data analysis\n\nHow we work\n\nBecause elections take place everywhere, our employees work from practically every state in the union. We embrace working remotely as the default. Our positions require regular, daily use of a computer (including the use of G-Suite and Slack) to conduct work and communicate with colleagues. We also have regular operating hours (10 am to 6 pm Eastern, Monday to Friday).\n\nFor those who prefer to work from an office, we are headquartered in Brooklyn, NY, and we provide support for co-working spaces around the country. We are happy to share more details about the office, including accessibility information, as on-site visits are planned.\n\nBenefits\n\nAs a member of the team, some of the benefits you’ll enjoy include:\n• 100% employer-paid medical, dental, and vision option for you and your dependents\n• 12 floating holidays and 25 days of Paid Time Off (PTO) per year\n• 12 weeks of paid parental leave\n• $1000 towards professional development activities\n\nWe also offer a 403(b) retirement plan, stipends for equipment and internet reimbursement, and annual Calm or Headspace subscription reimbursements.\n\nTo Apply\n\nPlease attach your resume and answers to the following questions:\n• How did you find this job listing?\n• Why are you interested in this role and working at Democracy Works?\n• Describe a data quality issue that you had a primary role in fixing. How did you resolve the issue and prevent it from happening again?\n• Are you authorized to work lawfully in the United States for Democracy Works?\n\nOur Commitment to Diversity, Equity & Inclusion (DEI) in Hiring\n\nDemocracy Works is an Equal Opportunity Employer and does not discriminate against applicants based on race, religion, color, disability, medical condition, legally protected genetic information, national origin, gender, sexual orientation, marital status, gender identity or expression, sex (including pregnancy, childbirth or related medical conditions), age, veteran status or other legally protected characteristics.\n\nAs part of our application, you’ll see an optional form used to collect U.S. Equal Employment Opportunity Commission (EEOC) demographic information. Please note the categories used in this survey are set by the EEOC and may not reflect all existing categories.The data collected in this form is anonymized and is used in our EEOC reporting and in ongoing assessment of our recruitment practices.\n\nDemocracy Works follows the I-9 requirements of the Immigration Reform and Control Act of 1986. Immigration sponsorship is not available for this position, and you must possess your own work authorization in the U.S. now and in the future to continue working in this position.\n\nPlease reach out to hr@democracy.works if you have any questions about our process or if you need an accommodation for a medical condition during the hiring process",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "5+ years of hands-on experience delivering technical projects using a functional, object-oriented or scripting programming language",
                    "An understanding of structured and unstructured data and data modeling techniques",
                    "Knowledge of SQL including schema design, query optimization, and migration of data to new schemas over time",
                    "A strong background in at least one programming language such as Python, R, Java, JavaScript, etc",
                    "Experience working with data warehouse/lake technologies like Amazon Redshift or Snowflake",
                    "Experience analyzing raw data, developing and maintaining datasets, and improving data quality and efficiency",
                    "You have experience with or an understanding of geospatial databases or spatial relational database extensions",
                    "You have experience with or an understanding of geospatial software such as ArcGIS or QGIS",
                    "You have a knowledge of machine learning techniques for data analysis"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Build data pipelines to ingest data from across the organization to enable data analysis",
                    "Enrich data sets with internal and external data sources to drive decision making and demonstrating our organization’s impact",
                    "Implement large-scale technical decisions that have multi-year impact such as choices of new framework, language, or vendors",
                    "Serve as a subject-matter expert in the data and software engineering space and act as a go-to resource for thought partnership",
                    "Provide technical mentorship to members of your team",
                    "Execute other tasks as may be assigned"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Most regions in the United States: $118,800 - $125,400",
                    "NYC-specific: $132,000 - $136,000",
                    "100% employer-paid medical, dental, and vision option for you and your dependents",
                    "12 floating holidays and 25 days of Paid Time Off (PTO) per year",
                    "12 weeks of paid parental leave",
                    "$1000 towards professional development activities",
                    "We also offer a 403(b) retirement plan, stipends for equipment and internet reimbursement, and annual Calm or Headspace subscription reimbursements"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://democracy.works/",
                "text": "democracy.works"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Democracy+Works&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCJUL",
                "text": "See web results for Democracy Works"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR87qmlGs5h8QwRDZiHMAjEpvSrYX_s2ZJ4gsUAtjWBFGMf7GqmgFGtNEI&s",
        "extensions": [
            "3 days ago",
            "119K–125K a year",
            "Work from home",
            "Full-time",
            "No degree mentioned",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Full-time",
            "salary": "119K–125K a year",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIgLSBEYXRhIiwiaHRpZG9jaWQiOiJUWjRvbnVkNHNGRUFBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoidXMiLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVTlFkMnBxVVRKVVJqaEpiVTh0WjIxWWJscFFZbFpVUldwc09FVjRUR00xTVV0eVZtRjZlblJLVVdWTU5ubDFjSEExYjNCUU9ESmphV0p6VUdoWlNtODRaSEJPYjFVMGJHTmxabkozWjNCaFFURnFaR2d3Y1RaV2IyVlhiakJ6ZGtaV1FWUlRPVTVOVjI1TFRWTlllakZ6V0RCakxVZGpjV014TkRSemIwSXhja1EwYzJaWE1GOWtkSEJoTjJZeE5UVTFiMmhhZERRMGQyMTRVSGd6V0dKT1ZHazNOSFZ6VWpOTWMwRm9NazAzVW1aamNuTm9Sa2RDWkVkbFRGWkhPVTV5WlZad2Vra3RlWGt0RWhjMVdtdFBXazltTkZCS1EwZDNZbXRRTWs5dFFTMUJPQm9pUVVaZk5rMUJVRmx3UVhaSWQwZElUbTAxUmxoeGRUUktabWd5TlU5U2NWRjFkdyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRGVtb2NyYWN5IEpvYnMiLCJsaW5rIjoiaHR0cHM6Ly93d3cuZGVtb2NyYWN5am9icy5vcmcvY29tcGFuaWVzL2RlbW9jcmFjeS13b3Jrcy9qb2JzLzIzODIyNTc2LXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlci1kYXRhP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Staff Software Engineer",
        "company_name": "Bayer",
        "location": "Anywhere",
        "via": "via LinkedIn",
        "description": "At Bayer we’re visionaries, driven to solve the world’s toughest challenges and striving for a world where ,Health for all, Hunger for none’ is no longer a dream, but a real possibility. We’re doing it with energy, curiosity and sheer dedication, always learning from unique perspectives of those around us, expanding our thinking, growing our capabilities and redefining ‘impossible’. There are so... many reasons to join us. If you’re hungry to build a varied and meaningful career in a community of brilliant and diverse minds to make a real difference, there’s only one choice.\n\nStaff Software Engineer\n\nYour Tasks And Responsibilities\n\nThe primary responsibilities of this role, Staff Software Engineer, are to:\n• Work as part of an agile development team to build and support applications;\n• Work with team and product manager to manage project priorities, deadlines, and deliverables; Interact directly with business customers to gather and understand requirements and how they translate in application features;\n• Develop applications and services using the right tool for the job.\n• Consistently contribute to solving organization wide problems including shared platforms, libraries, and frameworks;\n• Conduct functional and non-functional testing, troubleshoot and debug applications and deploy applications across all environments in collaboration with development team, product management, and delivery;\n• Champion code quality including unit and integration testing;\n• Evaluate existing applications to refactor, update and add new features. Develop any technical documentation needed to accurately represent application design and code;\n• Identify and pursue opportunities to improve own knowledge and skills and those of more junior engineers;\n• Identify opportunities to develop new and better solutions;\n• Anticipate and address technical and organizational obstacles affecting own team and teams within the domain platform;\n• Provide guidance for technical design and architecture decisions within and across teams;\n• Participate in the evaluation and selection of new technologies;\n• Mentor other people and teams on technologies, techniques or standards across the organization;\n• Build relationships with key members of partner teams.\n\nWho You Are\n\nYour success will be driven by your demonstration of our LIFE values. More specifically related to this\n\nposition, Bayer seeks an incumbent who possesses the following:\n\nRequired Qualifications:\n• Bachelors degree;\n• Experience in solving challenging technical problems in two or more of the following areas:\n• Single page web application development, unix/linux environment management, cloud based continuous delivery and environment management, mobile application development, micro service design and development, large distributed system development, software security processing and analyzing large data sets;\n• Experience designing cloud based software solutions;\n• Practical experience and understanding of industry practices, engineering principles, concepts, and standards;\n• Expertise in at least one technology or facet of product development (research, design, programming, testing);\n• Demonstrates capable business insight, strategic mindset, cultivates innovation, drives vision & purpose, and attracts & develops talent leadership competencies and decision making skills;\n• Demonstrates strong manages ambiguity leadership competency and written and verbal communication skills.\n\nPreferred Qualifications:\n• Bachelors degree in Computer Science, Computer Engineering, or equivalent experience. Minimum 8 years (Masters 6 or Doctorate 4) experience in solving challenging technical problems in two or more of the following areas: Single page web application development Unix/Linux environment management Cloud based continuous delivery and environment management Mobile application development Micro service design and development Large, distributed system development Software security Processing and analyzing large data sets;\n• Minimum 3 years designing cloud based software solutions.\n\nEmployees can expect to be paid a salary between $130,900 to $196,300 . Additional compensation may include a bonus or commission (if relevant). Additional benefits include health care, vision, dental, retirement, PTO, sick leave, etc.. This salary range is merely an estimate and may vary based on an applicant’s location, market data/ranges, an applicant’s skills and prior relevant experience, certain degrees and certifications, and other relevant factors.\n\nYOUR APPLICATION\n\nBayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and want to impact our mission Science for a better life, we encourage you to apply now. Be part of something bigger. Be you. Be Bayer.\n\nTo all recruitment agencies: Bayer does not accept unsolicited third party resumes.\n\nBayer is an Equal Opportunity Employer/Disabled/Veterans\n\nBayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below.\n\nIMPORTANT NOTE for POTENTIAL US CANDIDATES: Bayer expects its colleagues to be fully vaccinated against COVID-19. Bayer defines fully vaccinated in alignment with CDC which is two weeks after completing the two-dose vaccine regimen or two weeks after completing the one-dose regimen. Additionally, Bayer colleagues are also required to comply with state, local and customer requirements.\n\nLocation: United States : Residence Based : Residence Based\n\nDivision: Enabling Functions\n\nReference Code: 788401\n\nContact Us\n\nEmail: hrop_usa@bayer.com",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Bachelors degree;",
                    "Practical experience and understanding of industry practices, engineering principles, concepts, and standards;",
                    "Expertise in at least one technology or facet of product development (research, design, programming, testing);",
                    "Demonstrates capable business insight, strategic mindset, cultivates innovation, drives vision & purpose, and attracts & develops talent leadership competencies and decision making skills;",
                    "Demonstrates strong manages ambiguity leadership competency and written and verbal communication skills",
                    "Minimum 8 years (Masters 6 or Doctorate 4) experience in solving challenging technical problems in two or more of the following areas: Single page web application development Unix/Linux environment management Cloud based continuous delivery and environment management Mobile application development Micro service design and development Large, distributed system development Software security Processing and analyzing large data sets;",
                    "Minimum 3 years designing cloud based software solutions"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Work as part of an agile development team to build and support applications;",
                    "Work with team and product manager to manage project priorities, deadlines, and deliverables; Interact directly with business customers to gather and understand requirements and how they translate in application features;",
                    "Develop applications and services using the right tool for the job",
                    "Consistently contribute to solving organization wide problems including shared platforms, libraries, and frameworks;",
                    "Conduct functional and non-functional testing, troubleshoot and debug applications and deploy applications across all environments in collaboration with development team, product management, and delivery;",
                    "Champion code quality including unit and integration testing;",
                    "Evaluate existing applications to refactor, update and add new features",
                    "Develop any technical documentation needed to accurately represent application design and code;",
                    "Identify and pursue opportunities to improve own knowledge and skills and those of more junior engineers;",
                    "Identify opportunities to develop new and better solutions;",
                    "Anticipate and address technical and organizational obstacles affecting own team and teams within the domain platform;",
                    "Provide guidance for technical design and architecture decisions within and across teams;",
                    "Participate in the evaluation and selection of new technologies;",
                    "Mentor other people and teams on technologies, techniques or standards across the organization;",
                    "Build relationships with key members of partner teams"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Employees can expect to be paid a salary between $130,900 to $196,300",
                    "Additional compensation may include a bonus or commission (if relevant)",
                    "Additional benefits include health care, vision, dental, retirement, PTO, sick leave, etc.",
                    "Bayer offers a wide variety of competitive compensation and benefits programs"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.bayer.com/",
                "text": "bayer.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Bayer&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCOIL",
                "text": "See web results for Bayer"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTY1xt4dHEyacYK2dxe8y-S_n5tFQKgjyMyoNymc6g&s",
        "extensions": [
            "2 days ago",
            "Work from home",
            "Full-time",
            "Health insurance",
            "Dental insurance",
            "Paid time off"
        ],
        "detected_extensions": {
            "posted_at": "2 days ago",
            "schedule_type": "Full-time",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiWnI2c0wzWVMydjRBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVZIaEpXbmxtV0ZaVVpDMVJNMjVIVUMxUVVURkNhREp4T1dWZlJFaG5YMWRUVkV0TlRqRjBNazF4YVRZeFVHeGpNbTlCU1VneFowTnZhRlpDUlZsSmJEZzJORFpMUmtGeFp6bE9XRGxSVVhoNFFraElUVEl4TUZkeWJXbG5ZV05hVG1seFRFUmlTVjkwZEVZelpHOVpRa3R6Wm5ReFUwdHJOMWRvVVRoSVFtMXRXRXh6UzJKMUxVdDVOVEJOYWtsVWFUa3RZbmhsYm5ObmVXOURObEV4WDJkZllUTnVXR05zUzNOeVZETXRNa3BqRWhjMVdtdFBXazltTkZCS1EwZDNZbXRRTWs5dFFTMUJPQm9pUVVaZk5rMUJVSEZxYVVoblYxaGZTRTk2ZGxkRVUwczJkV3BEZFZJNWVGSXhVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zdGFmZi1zb2Z0d2FyZS1lbmdpbmVlci1hdC1iYXllci0zNTIyMDEyMzk3P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Training Software Engineer (Associate and Experienced)",
        "company_name": "Boeing",
        "location": "Oklahoma City, OK",
        "via": "via Careers At Boeing",
        "description": "Job Description\n\nAt Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your... future with us.\n\nBoeing Global Service Training Systems team is seeking Associate and Experienced Software Engineers to focus on operating system configuration/customization, visualization and software integration. Training Systems is responsible for the design, manufacture, development, and maintenance of a wide variety of commercial and military training devices. Primary location for these positions will be located in Oklahoma City, OK supporting the ASC2 AWACS Training System platform.\n\nAt Boeing, we are all innovators on a mission to connect, protect, explore and inspire. From the sea bed to outer space, you'll learn and grow, contributing to work that shapes the world.\n\nPosition Responsibilities:\n• Participate as a member of an impactful, collaborative team and be self-motivated with a strong work ethic, excellent time-management, and interpersonal skills\n• Integrate commercial and Boeing developed software into Windows and RedHat Enterprise Linux operating systems\n• Use Agile methodologies to support all aspects of product development and project management\n• Scripting to support application of security settings on Windows and RedHat Enterprise Linux platforms\n• Designing systems to meet current and future software and application requirements\n• Have the ability to work with multiple support teams to identify and resolve issues\n• Implement and test software/systems using a variety of technologies to include scripting to support automated testing\n• Networking and support of Ethernet and Fiber Channel networks\n• Support VMWare and Linux virtualization applications\n• Attend design and review board meetings to help facilitate system maturity and lifecycle support\n• Storage Area Network and Network Attached Storage administration\n• Occasional domestic or international travel may be required.\n\nThis position is hybrid. This means that the selected candidate will be required to perform some work onsite at one of the listed location options. This is at the hiring team’s discretion and could potentially change in the future.\n\nThis position requires an active U.S. Secret Security Clearance (U.S. Citizenship Required). (A U.S. Security Clearance that has been active in the past 24 months is considered active)\n\nBasic Qualifications (Required Skills and Experience):\n• Experience having System Administration experience of Linux/Unix or Windows platforms\n• 2+ years of experience in software systems integration\n• 2+ years of experience in scripting activities in a Linux or Windows environment\n\nDesired Experience, Skills and Qualifications:\n• 2 or more years' related work experience or an equivalent combination of education and experience\n• 3 or more years' related work experience or an equivalent combination of education and experience\n\nTypical Education and Experience:\n\nAssociate Level:\n\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 2 or more years' related work experience or an equivalent combination of technical education and experience (e.g. Masters degree plus experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nExperienced Level: Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD, Master+3 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nRelocation:\n\nThis position offers relocation based on candidate eligibility.\n\nDrug Free Workplace\n\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nGeneral\n\nShift (US Specific):\n\nThis position is for 1st shift\n\nPay Transparency:\n\nAt Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities.\n\nThe Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.\n\nThe specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.\n\nPlease note that the salary information shown below is a general guideline only. Salaries are based upon candidate experience and qualifications, as well as market and business considerations.\n\nSummary pay range:\n\nAssociate Level: $79,050 - $106,950\n\nExperienced Level: $96,900 - $131,100\n\nEligible for 3ERP\n\nExport Control Requirements: U.S. Government Export Control Status: This position must meet export control compliance requirements. To meet export control compliance requirements, a “U.S. Person” as defined by 22 C.F.R. §120.15 is required. “U.S. Person” includes U.S. Citizen, lawful permanent resident, refugee, or asylee.\n\nExport Control Details: US based job, US Person required\n\nEqual Opportunity Employer:\n\nBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "This position requires an active U.S. Secret Security Clearance (U.S. Citizenship Required)",
                    "(A U.S. Security Clearance that has been active in the past 24 months is considered active)",
                    "Experience having System Administration experience of Linux/Unix or Windows platforms",
                    "2+ years of experience in software systems integration",
                    "2+ years of experience in scripting activities in a Linux or Windows environment",
                    "Experienced Level: Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD, Master+3 years' related work experience)",
                    "Eligible for 3ERP",
                    "Export Control Requirements: U.S. Government Export Control Status: This position must meet export control compliance requirements",
                    "To meet export control compliance requirements, a “U.S. Person” as defined by 22 C.F.R. §120.15 is required",
                    "“U.S. Person” includes U.S. Citizen, lawful permanent resident, refugee, or asylee"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Training Systems is responsible for the design, manufacture, development, and maintenance of a wide variety of commercial and military training devices",
                    "Participate as a member of an impactful, collaborative team and be self-motivated with a strong work ethic, excellent time-management, and interpersonal skills",
                    "Integrate commercial and Boeing developed software into Windows and RedHat Enterprise Linux operating systems",
                    "Use Agile methodologies to support all aspects of product development and project management",
                    "Scripting to support application of security settings on Windows and RedHat Enterprise Linux platforms",
                    "Designing systems to meet current and future software and application requirements",
                    "Have the ability to work with multiple support teams to identify and resolve issues",
                    "Implement and test software/systems using a variety of technologies to include scripting to support automated testing",
                    "Networking and support of Ethernet and Fiber Channel networks",
                    "Support VMWare and Linux virtualization applications",
                    "Attend design and review board meetings to help facilitate system maturity and lifecycle support",
                    "Storage Area Network and Network Attached Storage administration",
                    "Occasional domestic or international travel may be required"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Drug Free Workplace",
                    "At Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent",
                    "Elements of the Total Rewards package include competitive base pay and variable compensation opportunities",
                    "The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work",
                    "The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements",
                    "Associate Level: $79,050 - $106,950",
                    "Experienced Level: $96,900 - $131,100"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.boeing.com/",
                "text": "boeing.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Boeing&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCKsM",
                "text": "See web results for Boeing"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR_QSC2slWkbRTy5kssdiAfBKyVQFpGlz5WoOeR&s=0",
        "extensions": [
            "5 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance"
        ],
        "detected_extensions": {
            "posted_at": "5 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJUcmFpbmluZyBTb2Z0d2FyZSBFbmdpbmVlciAoQXNzb2NpYXRlIGFuZCBFeHBlcmllbmNlZCkiLCJodGlkb2NpZCI6IllwME1HRU9JUVVNQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkVxSUNDdUlCUVVOUWQycHFWRUpaUm1GdFFqbGZObkJNWldaTFNtTndNRTU0V214WWFubDZhVFEzYTJaUU5rcGxTV3BFWmpkaGQxQnJhVFppY1dWSVJIVXRZWGhDY0VvNVVqYzVjVVZGVEc1NGQwTlhkeTFLYmpOdlNVaE5hVTkzU3psWmJYcEVYMWhWWW1VMFdDMUhWRVJ0Ym5WTFFWVXpWMVpJY2tJM1dYQTFaR1ZYUmtkaFVtVjBWRzVzU1c5cE5FMURXa1pKUTJ0TldqUlBjbXhNYW5BMFNEUjRSVjlPTVdKd2VWSk5ia3RNYkVoNWJtZFJha015VUZaWWRHUkljRGhhVGtJMFVFUlZWRFpyU1VWUWVVSjRUVTFEV1ZrNFZYZGhXV28yVUhJMlkxZE9SRm94WnhJWE5WcHJUMXBQWmpSUVNrTkhkMkpyVURKUGJVRXRRVGdhSWtGR1h6Wk5RVTV1V0cxMmQwNXFXaTB3YWtKb1ZXdEVRVUU1YWtKalQwVk1OMEUiLCJmY3YiOiIzIiwiZmNfaWQiOiJmY18xMCIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBDYXJlZXJzIEF0IEJvZWluZyIsImxpbmsiOiJodHRwczovL2pvYnMuYm9laW5nLmNvbS9qb2Ivb2tsYWhvbWEtY2l0eS90cmFpbmluZy1zb2Z0d2FyZS1lbmdpbmVlci1hc3NvY2lhdGUtYW5kLWV4cGVyaWVuY2VkLzE4NS80NTY5MzQyNTA0MD91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Intern Software Engineer - Platform Engineering- Secureworks ...",
        "company_name": "Secureworks",
        "location": "Anywhere",
        "via": "via Dell Careers",
        "description": "Software Engineer - Platform Engineering Intern\nLocation: Remote\n...\nWe are a fully remote software engineering team working on the company's next generation security platform. Our goal is to increase the security posture of all of our customers while building a collaborative and innovative engineering culture. We are a proud member of the Dell Technologies family and offer competitive benefit and compensation packages and reward and recognize our employees for exceptional results.\n\nThe platform team focuses on backend service and tooling development for other teams and customers to use. We build performant GraphQL APIs using Golang and Kubernetes for different features of our product, creating and reviewing designs for new projects, building robust software that other teams and customers can use, and collaborating with other internal and external engineering teams to solve problems, as well as building our internal authorization systems. If there is backend work we are involved in one way or another - and our goal as a team is to raise the bar of engineering practices across the larger organization.\n\nOur primary tech stack consists of Golang, Kubernetes, Postgres, and Elasticsearch, but we also use tools like ScyllaDB, Redis, Kafka, SQS, and various other AWS services as well.\n\nSkills and Requirements\n\nWe expect to see:\n• 1 Year of college education/STEM/bootcamp experience\n• A desire to learn and dive into new programming languages and technologies\n• Self motivating and self directed, great at communicating ideas with remote teams\n\nWhat we like to see (but not required):\n• Experience working with docker or kubernetes\n• Remote work experience with a geographically distributed team (currently we have teammates in PST to GMT time zones)\n• Software development experience in Go\n\nWork Environment\n\nWe are a remote first team and are geographically distributed across the US, Canada, and UK - we utilize tools like Mattermost, Google Meet and Zoom to facilitate communication and tools like Miro and Lucid Charts for diagramming and communicating ideas. We also believe in a strong work-life balance and providing support for team members to accomplish that. We are a family first company that values our team members and has benefits and a culture that will help them through important life events - such as taking care of family, parental leave, etc. We also value continuing education and skills development and have Tech Tuesdays where team members can present to the engineering organization, 3rd parties coming in and giving presentations, as well as training for services like AWS and Kubernetes.\n\n#LIREMOTE\n\nSecureworks (A Dell Technologies Company) is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Secureworks are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Secureworks will not tolerate discrimination or harassment based on any of these characteristics. Learn more about Diversity and Inclusion at Secureworks here",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "1 Year of college education/STEM/bootcamp experience",
                    "A desire to learn and dive into new programming languages and technologies",
                    "Self motivating and self directed, great at communicating ideas with remote teams",
                    "Experience working with docker or kubernetes",
                    "Remote work experience with a geographically distributed team (currently we have teammates in PST to GMT time zones)",
                    "Software development experience in Go"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.secureworks.com/",
                "text": "secureworks.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Secureworks&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCOoM",
                "text": "See web results for Secureworks"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRHGK2TZ0tRM4ozGLQ8LoUC7oH8g3uAAXwLJASFw08&s",
        "extensions": [
            "3 days ago",
            "Work from home",
            "Part-time"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Part-time",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJJbnRlcm4gU29mdHdhcmUgRW5naW5lZXIgLSBQbGF0Zm9ybSBFbmdpbmVlcmluZy0gU2VjdXJld29ya3MgLSAoMTAwJSBSZW1vdGUgVVM7IFdvcmsgRnJvbSBIb21lOyBPUiBBdXN0aW4sIFRYKSIsImh0aWRvY2lkIjoiTGpDanlmYjBRUW9BQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQ0NyY0NRVU5RZDJwcVV6bDZjRUpwZURBNWFqaGFYME16ZFU5dFEzaENkV0ZaWlc5cFlVRk9WSGx2UWxBMFpuWmphVFV5Tmt0eWEzSmtZbkZWY1hKeVpHNU9SV1F3ZDJsclpVNXpRMk5FZFdaUWFsaEZTMjlLV0ZaRlJIZHVZWG81WVcxdFFrSlpPR1ZIWVdkd1NWZHBZVTF0UkRsaWR6SkJlWEJHWWxWYWJrUlBRbmhyVlRRdFdVNHpSbFZaVHpsaVdHMXJUMTlsZWt0R1RGQm1iRVpNUjI1VmFXbEZUVVpuYVVRNU1ITjZNV05EVlVwdk9YUnZRWGgzUlVSWGEzRklMVE42Vm1WVVUzSTVURk5wVUZReGRFWkRjVFpKZGs4M01HeG9ZVXhTUzE5TWVVNU5helZFVW00eWRFUlBRaTFUTmxOSVlVUndVbmx3TFRKemVsaHdlRlJUY1VwbWFHOWhiVjlFYm1aZk5HNUtiR2xFU1d4VFpVWXlVbmd6U0VoeVRXMTNlVmw0UmpSRVZHVnhOMUE0VUVKMmFuVnJSRjlZZFVVU0Z6VmFhMDlhVDJZMFVFcERSM2RpYTFBeVQyMUJMVUU0R2lKQlJsODJUVUZQUWpOa1lXaEJNVVoyZVd0MVZESmhUMloyZGxkU05YaFllbHBCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTIiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gRGVsbCBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vam9icy5kZWxsLmNvbS9qb2IvcmVtb3RlL2ludGVybi1zb2Z0d2FyZS1lbmdpbmVlci1wbGF0Zm9ybS1lbmdpbmVlcmluZy1zZWN1cmV3b3Jrcy0xMDAtcmVtb3RlLXVzLXdvcmstZnJvbS1ob21lLW9yLWF1c3Rpbi10eC8zNzUvNDU3OTE3ODkwMjQ/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Software Engineer - Founding engineer",
        "company_name": "Evoly",
        "location": "Anywhere",
        "via": "via Y Combinator",
        "description": "•",
        "job_highlights": [
            {
                "items": [
                    "•"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Evoly&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCJkN",
                "text": "See web results for Evoly"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSn5Db4k68mSnWcuHcavdmQ3GPCqvwinTCBnNLOp4fAV8kETafjjv70bY8&s",
        "extensions": [
            "6 days ago",
            "60K–120K a year",
            "Work from home",
            "Full-time",
            "No degree mentioned"
        ],
        "detected_extensions": {
            "posted_at": "6 days ago",
            "schedule_type": "Full-time",
            "salary": "60K–120K a year",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEZvdW5kaW5nIGVuZ2luZWVyIiwiaHRpZG9jaWQiOiJ5Y29ZbjAwSUlpc0FBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoidXMiLCJobCI6ImVuIiwiZmMiOiJFb3dDQ3N3QlFVTlFkMnBxVVZCalowUjFXV056TkRGRlZFMXZiR1UwWVV4VlRuUnZSMWt4YlhWUmEwZEhTRjlRTmxKVlJ5MHpaQzA0Um1rMFJVODNjVlpsVGxkSGFWaGpTWFZGTTBkeWJpMXhVRzFXTVhOYVNWUkhkVUZIVDJvdGIzZHpkbUZPY2s1bmNGTmlTRkpSTVUxV1FrNU1ZMXBxYVhjdGRWVnNZMjg0Y1ZaMGFUQlBTRmRZVlUxWFdERlZMWEZ5UTBRNVFVVkliSHBsUWt4YVpUWmZhR3hMYnkxd1MwVXlSamh1TkVVMVpWUkNVR2hpZVc1SE1VRjNiemh5WTE4elZWSlBMWGh5VUdGV1NsOTVkR3B5RWhjMVdtdFBXazltTkZCS1EwZDNZbXRRTWs5dFFTMUJPQm9pUVVaZk5rMUJVRXN0ZGt0MWRsOVhWMUJRU0dkQ2NXOHRjMlZCTWxGcFZGWnNVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE0IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFkgQ29tYmluYXRvciIsImxpbmsiOiJodHRwczovL3d3dy55Y29tYmluYXRvci5jb20vY29tcGFuaWVzL2V2b2x5L2pvYnMvWDRxekdLcy1zb2Z0d2FyZS1lbmdpbmVlci1mb3VuZGluZy1lbmdpbmVlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer - Cloud Traffic",
        "company_name": "Confluent Career Site",
        "location": "United States",
        "via": "via Confluent Careers",
        "description": "Description\n\nConfluent is pioneering a fundamentally new category of data infrastructure focused on data in motion. Have you ever found a new favorite series on Netflix, picked up groceries curbside at Walmart, or paid for something using Square? That’s the power of data in motion in action—giving organizations instant access to the massive amounts of data that is constantly flowing throughout... their business. At Confluent, we’re building the foundational platform for this new paradigm of data infrastructure. Our cloud-native offering is designed to be the intelligent connective tissue enabling real-time data, from multiple sources, to constantly stream across the organization. With Confluent, organizations can create a central nervous system to innovate and win in a digital-first world.\n\nWe’re looking for self-motivated team members who crave a challenge and feel energized to roll up their sleeves and help realize Confluent’s enormous potential. Chart your own path and take healthy risks as we solve big problems together. We value having diverse teams and want you to grow as we grow—whether you’re just starting out in your career or managing a large team, you’ll be amazed at the magnitude of your impact.\n\nAbout the Role:\n\nTo realize Confluent’s enormous potential, we are looking for software engineers, at various levels, to grow our Traffic & Networking team. This team focuses on building and managing the networking fabric of Confluent Cloud. The network fabric for Confluent Cloud is responsible for all traffic that ingresses and egresses a customer's Kafka cluster on Confluent Cloud. The networking fabric also provides features that allow Confluent customers to securely connect their Confluent Cloud clusters to their existing virtual networks in the cloud. This gives customers access to enterprise-grade security features in the cloud allowing them to build secure network boundaries around their clusters.\n\nTo join the team, we are looking for engineers with an interest in building large-scale distributed systems, with a focus on building and managing network data planes for containerized workloads in the cloud.\n\nWho you are:\n• Smart, humble, and empathetic\n• Have a strong sense of teamwork and put team’s and company’s interests first\n• Driven and excited about the challenges of a fast-paced, innovative software startup environment\n\nWhat Gives You an Edge:\n• BS, MS, or PhD in computer science or a related field, or equivalent work experience\n• 1-4 years of relevant cloud infrastructure/cloud networking experience\n• Strong fundamentals in distributed systems design and development\n• Experience building and operating large-scale systems\n• Solid understanding of basic systems operations (disk, network, operating systems, etc)\n• A self-starter with the ability to work effectively in teams\n• Proficiency in Go, Python, C++, or other statically typed languages\n• Experience/knowledge with public clouds (AWS, Azure or GCP)\n\nCome As You Are\n\nAt Confluent, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. The more diverse we are, the richer our community and the broader our impact. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law.\n\nAt Confluent, we are committed to providing competitive pay and benefits that are in line with industry standards. We analyze and carefully consider several factors when determining compensation, including work history, education, professional experience, and location. This position has an annual estimated salary of 131,700 - 151,400 USD, an annual bonus, and a competitive equity package. The actual pay may vary depending on your skills, qualifications, experience, and work location. In addition, Confluent offers a wide range of employee benefits. To learn more about our benefits click HERE.\n\nConfluent requires all employees (in office and remote) in the U.S. to be vaccinated for COVID-19. Consistent with federal, state, and local requirements, Confluent will consider requests for reasonable accommodation based on medical conditions/contraindications or sincerely-held religious beliefs where it is able to do so without undue hardship to the company.\n\nClick HERE to review our Candidate Privacy Notice which describes how and when Confluent, Inc., and its group companies, collects, uses, and shares certain personal information of California job applicants and prospective employees.\n\n#LI-Remote",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Smart, humble, and empathetic",
                    "Have a strong sense of teamwork and put team’s and company’s interests first",
                    "Driven and excited about the challenges of a fast-paced, innovative software startup environment",
                    "BS, MS, or PhD in computer science or a related field, or equivalent work experience",
                    "1-4 years of relevant cloud infrastructure/cloud networking experience",
                    "Strong fundamentals in distributed systems design and development",
                    "Experience building and operating large-scale systems",
                    "Solid understanding of basic systems operations (disk, network, operating systems, etc)",
                    "A self-starter with the ability to work effectively in teams",
                    "Proficiency in Go, Python, C++, or other statically typed languages",
                    "Experience/knowledge with public clouds (AWS, Azure or GCP)"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "The network fabric for Confluent Cloud is responsible for all traffic that ingresses and egresses a customer's Kafka cluster on Confluent Cloud",
                    "This gives customers access to enterprise-grade security features in the cloud allowing them to build secure network boundaries around their clusters"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "This position has an annual estimated salary of 131,700 - 151,400 USD, an annual bonus, and a competitive equity package",
                    "The actual pay may vary depending on your skills, qualifications, experience, and work location",
                    "In addition, Confluent offers a wide range of employee benefits"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.confluent.io/",
                "text": "confluent.io"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Confluent+Career+Site&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCN8N",
                "text": "See web results for Confluent Career Site"
            }
        ],
        "extensions": [
            "3 days ago",
            "Full-time",
            "Health insurance"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIENsb3VkIFRyYWZmaWMiLCJodGlkb2NpZCI6Ik5kOVAwaE5CUGJBQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVVOUWQycHFVV3BYYVdGME9IcFpUbTVDVm5SSk9XRTVjMXBsTm5Cck1ubGtZelEzTVhodlkwdExVVkpMYmtaU01VWmFiVzlITm1kNGVVWXlkVE5xVjJsU05uTlRMVGhGVldwTWNYRk9OMTgyTUhaWWRVUlFTM0J4T0ZjeGRubHNTUzFXVmpWWGRrUlpSUzFNUWpSSFh6SlFOMmxQUlZsUmNrRldkVzF3WTIwMlkzaDRkVUZKZFVGMVJYQldhRmhpUzJKQ2VucEhTamxZTVhRdFdqazRWazFKWkdGck9UZHlYMGxIZEY5aGFrUXdRV3R6U2pkaVZVSlRkbGhMV1V0WmNWRkxUelJ6V21KVFJGZFVFaGMxV210UFdrOW1ORkJLUTBkM1ltdFFNazl0UVMxQk9Cb2lRVVpmTmsxQlRUUkhTM3BNZWxZd2FETTBkWGx4Ylhad2NHRlFRVEo2TUdWdlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTYiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ29uZmx1ZW50IENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmNvbmZsdWVudC5pby9qb2JzLzEyMDM0ODk0LXNvZnR3YXJlLWVuZ2luZWVyLWNsb3VkLXRyYWZmaWM/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Software Engineer Associate & Mid-Level (Ground Systems)",
        "company_name": "Boeing",
        "location": "Oklahoma City, OK",
        "via": "via Careers At Boeing",
        "description": "Job Description\n\nAt Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your... future with us.\n\nThe Boeing Company is currently seeking Associate & Mid-Level Software Engineer to work on Software Development and Integration. Training Systems is responsible for the design, manufacture, development, and maintenance of a wide variety of commercial and military ground support and training devices. You would be primarily supporting the ASC2 and AEW&C Ground Systems platforms, in Oklahoma City, OK.\n\nPOSITION RESPONSIBILITIES:\n• You will be developing software applications (JAVA, C#), working with software provided by Boeing organizations, generating requirements, maintaining Software Interface Documents, evaluating designs, integrating the Software into the Ground System. Target host environments include Linux and Windows.\n• If you come to work with us you will be responsible for full life-cycle software development which means you will have a hand in defining the requirements; designing, implementing and testing the software; and supporting these products through delivery and in the field.\n• Will be a member of an impactful, collaborative team and must be self-motivated with a strong work ethic, excellent time-management, and interpersonal skills.\n• These teams use agile methodologies to support all aspects of product development, including project management.\n• You will be encouraged to actively help the team to continuously improve and develop innovative and creative solutions to products and processes.\n\nThis position is expected to be 100% onsite. The selected candidate will be required to work onsite at one of the listed location options.\n\nOccasional travel may be required (up to 15%).\n\nSecurity Clearance:\n\nThis position requires the ability to obtain a US Security Clearance for which the US Government requires US Citizenship. An interim and/or final U.S. Secret Clearance Post-Start is required.\n\nBasic Qualifications (Required Skills and Experience):\n• Bachelor of Science degree from an accredited course of study, in Computer Engineering, Software Engineering, Computer Science or other technical degree\n• 2+ years of experience in software development\n• 1+ years of experience with C#/.NET, and/or JAVA\n• 1+ years of experience in software development life cycles, configuration management and best agile software engineering practices\n\n​\n\nDesired Experience, Skills and Qualifications:\n• 2 or more years' related work experience or an equivalent combination of education and experience\n\n5 or more years' related work experience or an equivalent combination of education and experience\n• Experience with Scaled Agile Framework or Agile Methodologies.\n• 1+ years of experience working with Virtualized Systems (i.e. VMWare) design and implementation\n• Experience in software system integration and test\n• Experience with software containerization\n\nTypical Education and Experience:\n\nAssociate Level (6J7BI2)\n\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 2 or more years' related work experience or an equivalent combination of technical education and experience (e.g. Master). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nMid-Level (6J7BI3)\n\nEducation/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD, Master+3 years' related work experience). In the USA, ABET accreditation is the preferred, although not required, accreditation standard.\n\nRelocation\n\nThis position offers relocation based on candidate eligibility.\n\nDrug Free Workplace\n\nBoeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies.\n\nAt Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities.\n\nShift (US Specific):\n\nThis position is for 1st shift\n\nSalary Transparency:\n\nThe Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work.\n\nThe specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.\n\nPlease note that the salary information shown below is a general guideline only. Salaries are based upon candidate experience and qualifications, as well as market and business considerations.\n\nSummary pay range:\n\nAssociate Level\n\n$79,050 - 106,950\n\nMid-Level\n\n$96,900 – $131,100\n\nEligible for 3ERP\n\nExport Control Requirements: U.S. Government Export Control Status: This position must meet export control compliance requirements. To meet export control compliance requirements, a “U.S. Person” as defined by 22 C.F.R. §120.15 is required. “U.S. Person” includes U.S. Citizen, lawful permanent resident, refugee, or asylee.\n\nExport Control Details: US based job, US Person required\n\nEqual Opportunity Employer:\n\nBoeing is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, physical or mental disability, genetic factors, military/veteran status or other characteristics protected by law",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "This position requires the ability to obtain a US Security Clearance for which the US Government requires US Citizenship",
                    "An interim and/or final U.S. Secret Clearance Post-Start is required",
                    "Bachelor of Science degree from an accredited course of study, in Computer Engineering, Software Engineering, Computer Science or other technical degree",
                    "1+ years of experience with C#/.NET, and/or JAVA",
                    "1+ years of experience in software development life cycles, configuration management and best agile software engineering practices",
                    "Experience with Scaled Agile Framework or Agile Methodologies",
                    "1+ years of experience working with Virtualized Systems (i.e",
                    "VMWare) design and implementation",
                    "Experience in software system integration and test",
                    "Experience with software containerization",
                    "Associate Level (6J7BI2)",
                    "Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD, Master+3 years' related work experience)",
                    "Export Control Requirements: U.S. Government Export Control Status: This position must meet export control compliance requirements",
                    "To meet export control compliance requirements, a “U.S. Person” as defined by 22 C.F.R. §120.15 is required",
                    "“U.S. Person” includes U.S. Citizen, lawful permanent resident, refugee, or asylee"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Training Systems is responsible for the design, manufacture, development, and maintenance of a wide variety of commercial and military ground support and training devices",
                    "You would be primarily supporting the ASC2 and AEW&C Ground Systems platforms, in Oklahoma City, OK",
                    "You will be developing software applications (JAVA, C#), working with software provided by Boeing organizations, generating requirements, maintaining Software Interface Documents, evaluating designs, integrating the Software into the Ground System",
                    "If you come to work with us you will be responsible for full life-cycle software development which means you will have a hand in defining the requirements; designing, implementing and testing the software; and supporting these products through delivery and in the field",
                    "Will be a member of an impactful, collaborative team and must be self-motivated with a strong work ethic, excellent time-management, and interpersonal skills",
                    "These teams use agile methodologies to support all aspects of product development, including project management",
                    "You will be encouraged to actively help the team to continuously improve and develop innovative and creative solutions to products and processes"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Drug Free Workplace",
                    "Elements of the Total Rewards package include competitive base pay and variable compensation opportunities",
                    "The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work",
                    "The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements",
                    "$96,900 – $131,100"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Boeing&sa=X&ved=0ahUKEwin_7be_Nf9AhUQQzABHdg0AP8QmJACCKMO",
                "text": "See web results for Boeing"
            }
        ],
        "extensions": [
            "5 days ago",
            "Full-time",
            "Health insurance",
            "Dental insurance"
        ],
        "detected_extensions": {
            "posted_at": "5 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBBc3NvY2lhdGUgXHUwMDI2IE1pZC1MZXZlbCAoR3JvdW5kIFN5c3RlbXMpIiwiaHRpZG9jaWQiOiJwXzZJb2dHYlAta0FBQUFBQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyIsImdsIjoidXMiLCJobCI6ImVuIiwiZmMiOiJFcUlDQ3VJQlFVTlFkMnBxVXpVd2FVbG5kVk5IZFhCeFR6TjJibXRKU2pGV1JYRjNiak5GVG5oTlRFRTJXSEJtT1VWZmVtaHBNMFE0WVV0ZllrYzFWbU5oYkUxS01VbFpOek5oVUVFeVdIbzBOM2hoUWtsbFpGWXdVRmhYV0djMFozSkpOakJYTjFaR1N5MTRibmh0VFdkQ1gzbHVXRGhmVW5oSllqSTFWVmg1VFU5elYwTTRYMDlXTFRaNVR6TlVVSGM1V21ZMloySnhSRlYwZHpSemJrOUViM1IzWDFWVk1WcHRlVXRxVkRkQllWUnlhWFJ1UW1ONldWZzNYMU01ZWtsQ2VsUm9TREJ6YURWMldYTkNOREp4VFZoRFFVRkVTSEZhT1c1V1NtVmpTSG8xUVMxeVp4SVhOVnByVDFwUFpqUlFTa05IZDJKclVESlBiVUV0UVRnYUlrRkdYelpOUVU0M1JWbzRMV2x0VEY5NmJVMDVTWE5oY2tSRlIzYzRaRFJyYlVFIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTgiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ2FyZWVycyBBdCBCb2VpbmciLCJsaW5rIjoiaHR0cHM6Ly9qb2JzLmJvZWluZy5jb20vam9iL29rbGFob21hLWNpdHkvc29mdHdhcmUtZW5naW5lZXItYXNzb2NpYXRlLWFuZC1taWQtbGV2ZWwtZ3JvdW5kLXN5c3RlbXMvMTg1LzQ1Njc1ODk3MTY4P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Software Engineer",
        "company_name": "Goliath Partners",
        "location": "Anywhere",
        "via": "via LinkedIn",
        "description": "Goliath Partners is working with a new leading exchange backed by Jump Capital & Sequoia that is looking for a Core Software Engineer.\n\nThe role is 100% remote and they have offices in New York, Sydney and England. The firm has already reached $15B in accumulated trades on it's platform...\n\nRole:\n\nDeveloping trading infrastructure.\n\nData structures, algorithm development & work on distributed systems.\n\nExchange gateway connectivity.\n\nEssential skills:\n\nLooking for a Junior to Mid level professional that has graduated in recent years, ideally with a BS in CompSci or similarly related field.\n\nC, C++ experience.\n\nPrior/ current experience working at a trading shop (ideally with HFT).\n\nInterest in Crypto/ De-Fi is a must.\n\nComp:\n\nOur client is looking at paying $140,000-180,000 on the base with equity that brings this up to $220,000-300,000 DOE. The equity portion can be monetized after a 1 year cliff unlike other ventures where you don't have it vested for four years (and even then you are waiting for an event/ IPO to make money on it).\n\nIf interested please apply with your most up to date resume and we will be in touch",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Looking for a Junior to Mid level professional that has graduated in recent years, ideally with a BS in CompSci or similarly related field",
                    "C, C++ experience",
                    "Prior/ current experience working at a trading shop (ideally with HFT)",
                    "Interest in Crypto/ De-Fi is a must"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Developing trading infrastructure",
                    "Data structures, algorithm development & work on distributed systems"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Our client is looking at paying $140,000-180,000 on the base with equity that brings this up to $220,000-300,000 DOE"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.goliathpartners.com/",
                "text": "goliathpartners.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Goliath+Partners&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIIywk",
                "text": "See web results for Goliath Partners"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSRjqGwDL6Yr4-vqx8F4RqaxMrJx95nMy02O1pfEjI&s",
        "extensions": [
            "1 day ago",
            "240K–300K a year",
            "Work from home",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "1 day ago",
            "schedule_type": "Full-time",
            "salary": "240K–300K a year",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiYlBWaWRTcF9zdXdBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVVqUkJaMUJFV213Mk1sRjFOMGwxYjJwbmIzZEtMVU5KUVhaRVJXdHBUREV5WDJKYVJtY3dPV3Q0UkdObE5TMURaVXRPZVZadFpqRmZRa0l5ZEhKbk5WQnBMVlZGT0dGQlZFUXlkRWRUZHpsRmFtVTJWekpCVFhKRFYzUkdlbUkwTjBOU1ZFaEpia2RPT0RKVGN6aGZaSGxwTW1GamNsSmFSRVZ1UzJ4NVNGWXlXVFkyZUVZMFMzWmpjRGRRVDJKWmVVMW1XVXBtU0c4d1RreHRXVEkxUmxwUFJVZzBTV2RDVVZBMGRWQlNOelE0RWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUelpVTkVOR2RtSlNNVFJ5YlVwMk1VdzBTSEpRVW5CM1dHWnVadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiLm5GZzJlYntmb250LXdlaWdodDo1MDB9LkJpNkRkY3tmb250LXdlaWdodDo1MDB9QXBwbHkgb24gTGlua2VkSW4iLCJsaW5rIjoiaHR0cHM6Ly93d3cubGlua2VkaW4uY29tL2pvYnMvdmlldy9zb2Z0d2FyZS1lbmdpbmVlci1hdC1nb2xpYXRoLXBhcnRuZXJzLTM1MjMzNzY1NzY/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Software Engineer",
        "company_name": "Confluent Career Site",
        "location": "United States",
        "via": "via Confluent Careers",
        "description": "Description\n\nConfluent is pioneering a fundamentally new category of data infrastructure focused on data in motion. Have you ever found a new favorite series on Netflix, picked up groceries curbside at Walmart, or paid for something using Square? That’s the power of data in motion in action—giving organizations instant access to the massive amounts of data that is constantly flowing throughout... their business. At Confluent, we’re building the foundational platform for this new paradigm of data infrastructure. Our cloud-native offering is designed to be the intelligent connective tissue enabling real-time data, from multiple sources, to constantly stream across the organization. With Confluent, organizations can create a central nervous system to innovate and win in a digital-first world.\n\nWe’re looking for self-motivated team members who crave a challenge and feel energized to roll up their sleeves and help realize Confluent’s enormous potential. Chart your own path and take healthy risks as we solve big problems together. We value having diverse teams and want you to grow as we grow—whether you’re just starting out in your career or managing a large team, you’ll be amazed at the magnitude of your impact.\n\nAbout the Role:\nThe next big goal for Confluent is to make it as easy as possible for anyone to use Confluent’s products, including Kafka, to build their next killer streaming application. We are at the beginning of this journey and are looking for great engineers to come join our world-class team that is passionate about building and running large-scale, multi-tenant distributed systems for customers that expect a very high level of availability.\n\nBackend engineers at Confluent work on a set of diverse and complex challenges such as building foundational cloud frameworks and services that power all components of the platform in the Cloud. The services cover domains of billing, security, org hierarchy, marketplace integrations, to name a few, and involve working on various aspects of our multi-cloud and multi-tenant solution at different levels of the backend stack.\n\nWe’re actively hiring for various backend engineering teams such as Observability, Kafka Connect, Data Governance, Control Plane, Monetization, Client partnerships, Foundations etc.\n\nWhat You Will Do:\n• Build mission-critical backend services that deliver value to our customers. You will play a crucial role in architecting, designing, developing and operationalizing high performance, scalable, reliable and resilient services\n• Troubleshoot and debug technical issues inside a deep and complex technical stack that includes microservices, containers, and virtualization\n• Ensure operational readiness of the services and meet the availability and performance SLA commitments to our customers\n• A strategic engineer who constantly thinks of process and operational improvements\n\nWhat You Will Bring:\n• 4+ years industry experience designing, building, and supporting backend systems in production with a solid grasp on good software engineering practices such as code reviews, deep focus on quality, and documentation\n• Direct experience building systems with online components that serve user request\n• Strong programming and algorithmic skills. Proficiency in a major programming language, e.g. Java, Go, C / C++, Python, etc.\n• BS, MS, or PhD in computer science or a related field, or equivalent work experience\n\nCome As You Are\n\nAt Confluent, equality is a core tenet of our culture. We are committed to building an inclusive global team that represents a variety of backgrounds, perspectives, beliefs, and experiences. The more diverse we are, the richer our community and the broader our impact. Employment decisions are made on the basis of job-related criteria without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other classification protected by applicable law.\n\nAt Confluent, we are committed to providing competitive pay and benefits that are in line with industry standards. We analyze and carefully consider several factors when determining compensation, including work history, education, professional experience, and location. This position has an annual estimated salary of 117,500 - 132,200 USD, an annual bonus, and a competitive equity package. The actual pay may vary depending on your skills, qualifications, experience, and work location. In addition, Confluent offers a wide range of employee benefits. To learn more about our benefits click HERE.\n\nConfluent requires all employees (in office and remote) in the U.S. to be vaccinated for COVID-19. Consistent with federal, state, and local requirements, Confluent will consider requests for reasonable accommodation based on medical conditions/contraindications or sincerely-held religious beliefs where it is able to do so without undue hardship to the company.\n\nClick HERE to review our Candidate Privacy Notice which describes how and when Confluent, Inc., and its group companies, collects, uses, and shares certain personal information of California job applicants and prospective employees.\n\n#LI-Remote",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "4+ years industry experience designing, building, and supporting backend systems in production with a solid grasp on good software engineering practices such as code reviews, deep focus on quality, and documentation",
                    "Direct experience building systems with online components that serve user request",
                    "Strong programming and algorithmic skills",
                    "Proficiency in a major programming language, e.g. Java, Go, C / C++, Python, etc",
                    "BS, MS, or PhD in computer science or a related field, or equivalent work experience"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Build mission-critical backend services that deliver value to our customers",
                    "You will play a crucial role in architecting, designing, developing and operationalizing high performance, scalable, reliable and resilient services",
                    "Troubleshoot and debug technical issues inside a deep and complex technical stack that includes microservices, containers, and virtualization",
                    "Ensure operational readiness of the services and meet the availability and performance SLA commitments to our customers",
                    "A strategic engineer who constantly thinks of process and operational improvements"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "This position has an annual estimated salary of 117,500 - 132,200 USD, an annual bonus, and a competitive equity package",
                    "The actual pay may vary depending on your skills, qualifications, experience, and work location",
                    "In addition, Confluent offers a wide range of employee benefits"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.confluent.io/",
                "text": "confluent.io"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Confluent+Career+Site&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIIjwo",
                "text": "See web results for Confluent Career Site"
            }
        ],
        "extensions": [
            "3 days ago",
            "Full-time",
            "Health insurance"
        ],
        "detected_extensions": {
            "posted_at": "3 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoibFF2ZkNfWURGejRBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVZHZHVPWFp0ZUhKWVRVdG9RamR0WlZCMFNEWk1RWFpwVkdWaFgwUnNlR0ZqYnpGamJEbEZaV2QzY1RBNVFWSnVXbkpGT1Zkd1JXaG1kbFUyTkZSaFlXTjVObkoyWlhaWmNYRXRiRzl3VjNablYyYzRMVlp4ZUZoVFdIQllORkZDYzJseFgwUXdXVzVIUzI1bmNVYzJjR001VVU4eE5GUlJjRVJXVUVJNWJIYzVVelZJT0VKd1dGWldaWHBZV1RkaWIwSndSbFkzVEVKQlNFaEZNRzV4VUZjM1NtUmtkRlpFTVZSMVFXWmlOR3hSRWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUbXRtWlRaelEybEZZVzQxZVZvNFgxZEphMmxaVEZKNVRVRnFVUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzMiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gQ29uZmx1ZW50IENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly9jYXJlZXJzLmNvbmZsdWVudC5pby9qb2JzLzEyMDM0ODgyLXNvZnR3YXJlLWVuZ2luZWVyP3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Senior Software Engineer",
        "company_name": "Property Meld",
        "location": "Anywhere",
        "via": "via Property Meld",
        "description": "Senior Software Engineer\nWelcome to the future of property maintenance. Property Meld’s vision is to radically improve how the property management industry handles property maintenance. If you’ve ever had a maintenance issue at your housing rental, you know how much of a pain it can be to get it fixed quickly and reliably. Join Property Meld and help solve the headache that is rental maintenance... We’re a small, profitable company, who have been working remotely since long before it became trendy. Recognized as one of the fastest-growing startups in property management, we are looking for a motivated senior software engineer who wants to have an immediate impact.\n\nYour Role\nAs a senior engineer, You will tackle tough engineering problems while developing and shipping new features for our product, making sure they are performant, scalable, and well-engineered. As part of our remote-first engineering team, you will build on the foundation of a modern web application used by hundreds of thousands of people. You’ll help scale Property Meld’s web application by developing new features, improving our CI/CD processes, profiling and fixing performance issues, and solving technical challenges alongside the rest of the team. We’re looking for someone who:\n• Can ship software with exceptional quality in a high-velocity team\n• Can solve problems without adding accidental complexity\n• Can take ownership of projects and architect them from the ground up to be scalable, maintainable, and elegant in design\n• Is an expert in at least one area of building web applications and proficient in other areas\n• Has a bias for action\n• Has 8+ years of professional software development experience\n• Has experience in some or all of the following: Python, Typescript, Django, React, and various data stores (relational databases, NoSQL databases)\n\nWe recognize that good engineers can learn any technology so don’t hesitate to apply if your background is in other technologies. Our focus is on delivering an amazing product at an impressive rate to our customers.\n\nWhat you’ll get\n• A remote work environment and a work laptop of your choice.\n• Great work-life balance\n• The chance to build and scale out an ambitious project\n• A team environment with a culture of execution\n• Involvement in the decision-making process\n• Great teammates that care about your success\n• A chance to help solve the headache that is maintenance for millions of people\n\nPay and benefits We provide a competitive benefits plan including health, dental, and vision coverage as well as a 401(k). We provide an Employee Share Options Plan where every team member has a stake in the success we are building. The product team at Property Meld is a remote-work organization. We require 4 hours of overlap time, daily, with the Mountain Time zone. The position is fully remote with the exception of a couple of yearly company get-togethers to meet in person.\n• Candidates must be eligible for full-time employment in the United States",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Can ship software with exceptional quality in a high-velocity team",
                    "Can solve problems without adding accidental complexity",
                    "Can take ownership of projects and architect them from the ground up to be scalable, maintainable, and elegant in design",
                    "Is an expert in at least one area of building web applications and proficient in other areas",
                    "Has a bias for action",
                    "Has 8+ years of professional software development experience",
                    "Has experience in some or all of the following: Python, Typescript, Django, React, and various data stores (relational databases, NoSQL databases)",
                    "We recognize that good engineers can learn any technology so don’t hesitate to apply if your background is in other technologies",
                    "Candidates must be eligible for full-time employment in the United States"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Property Meld’s vision is to radically improve how the property management industry handles property maintenance",
                    "If you’ve ever had a maintenance issue at your housing rental, you know how much of a pain it can be to get it fixed quickly and reliably",
                    "As a senior engineer, You will tackle tough engineering problems while developing and shipping new features for our product, making sure they are performant, scalable, and well-engineered"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "A remote work environment and a work laptop of your choice",
                    "Great work-life balance",
                    "The chance to build and scale out an ambitious project",
                    "Great teammates that care about your success",
                    "A chance to help solve the headache that is maintenance for millions of people",
                    "Pay and benefits We provide a competitive benefits plan including health, dental, and vision coverage as well as a 401(k)"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Property+Meld&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAII1Qo",
                "text": "See web results for Property Meld"
            }
        ],
        "extensions": [
            "7 days ago",
            "Work from home",
            "Full-time",
            "No degree mentioned",
            "Health insurance",
            "Dental insurance"
        ],
        "detected_extensions": {
            "posted_at": "7 days ago",
            "schedule_type": "Full-time",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgU29mdHdhcmUgRW5naW5lZXIiLCJodGlkb2NpZCI6IlBJeldKWkVnbHZ3QUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkV1SUJDcUlCUVVOUWQycHFVVVJ5WDBNM05HcDFMVTlrUVMwME4zbzBUbWRETW5SME1rOURNVFZYT0VRMlV6TTFTMnhTT0RkUGRrUk9jR2h6WDJ4NFVTMTBTMDFOYVdsd2NtOVpRM0ZrU1dORUxWRlJibFJqYkV4RVJrMXZPVkpIYzFaZk9HZEhTbWd6U1ZkMExYcEJOakpTWVROdWExOXJUbXN0VDJ4cGJIRjZOSHBwY0VGcmF6bGFXbnBtVjJOWldrRmFla2RxVlZGNVVrYzVUVnB5YUdkdWQweHNibmRSRWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUbEpxYUhoNGF6VnhkbVpJTFRoMGJXVlBURkZ0TW5vMVduWkNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzUiLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgb24gUHJvcGVydHkgTWVsZCIsImxpbmsiOiJodHRwczovL3Byb3BlcnR5LW1lbGQuYnJlZXp5LmhyL3AvODBmNTdhYWQyY2NhLXNlbmlvci1zb2Z0d2FyZS1lbmdpbmVlcj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer",
        "company_name": "Aura",
        "location": "United States",
        "via": "via VentureFizz",
        "description": "Aura is on a mission to create a safer internet. In a world where our lives are increasingly online, Aura's category-defining suite of intelligent digital safety products help millions of customers protect themselves against digital threats, and that number is growing rapidly. This is an exciting phase at Aura, and our team of over 600 people worldwide is guided by a leadership slate that's... successfully grown startups into multi-billion dollar organizations.\n\nCome join us for the ride!\n\nDay to Day:\n• Design and develop cloud and backend services for IoT devices for the purpose of providing parental controls and other digital security features.\n• Design and develop firmware/embedded software of IoT devices and network packet flow management.\n• Adapt to different teams and technologies including cloud, firmware and app development to assist time-sensitive objectives.\n• Propose and implement new development processes and process improvements. Participate in on-call rotation for production issues, along with other members of the engineering team.\n• Complete development assignments on time with high quality.\n• Job location is 250 Northern Avenue, 3rd Fl, Boston, MA 02210 (Full-time telecommuting permitted)\nWhat you bring to the table:\n• Job requires a Bachelors degree in Computer Science, Network Systems or a closely related field, and 2 years of software development experience.\n• Must have 2 years of experience in each of the following:\n• Cloud service development, written in Go\n• Cloud computing platforms (AWS or GCP) and Kubernetes\n• C and C++ to develop Embedded Linux applications\n• Cloud-based APIs on Embedded Linux\n• GNU cross compiling toolchain and firmware builds\n• Objective-C, Swift, Kotlin, Java, and React Native\n\nAura is proud to be an equal employment workplace. All qualified applicants will be considered for employment without regard to, and will not be discriminated against based on race, color, ancestry, national origin, religion, age, sex, gender, marital status, sexual orientation, gender identity, disability status, veteran status, or any protected category. Beyond equal employment opportunity, Aura is committed to being an inclusive community where all feel welcome.\n\nAura is dedicated to providing an accessible environment for all candidates during the application process and for employees during their employment. If you need accessibility assistance and/or a reasonable accommodation due to a disability, please let your Talent Acquisition Partner know.\n\nImportant privacy information for California job applicants can be found here",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Job requires a Bachelors degree in Computer Science, Network Systems or a closely related field, and 2 years of software development experience",
                    "Must have 2 years of experience in each of the following:",
                    "Cloud service development, written in Go",
                    "Cloud computing platforms (AWS or GCP) and Kubernetes",
                    "C and C++ to develop Embedded Linux applications",
                    "Cloud-based APIs on Embedded Linux",
                    "GNU cross compiling toolchain and firmware builds",
                    "Objective-C, Swift, Kotlin, Java, and React Native"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Design and develop cloud and backend services for IoT devices for the purpose of providing parental controls and other digital security features",
                    "Design and develop firmware/embedded software of IoT devices and network packet flow management",
                    "Adapt to different teams and technologies including cloud, firmware and app development to assist time-sensitive objectives",
                    "Propose and implement new development processes and process improvements",
                    "Participate in on-call rotation for production issues, along with other members of the engineering team",
                    "Complete development assignments on time with high quality",
                    "Job location is 250 Northern Avenue, 3rd Fl, Boston, MA 02210 (Full-time telecommuting permitted)"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Aura&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIImws",
                "text": "See web results for Aura"
            }
        ],
        "extensions": [
            "6 days ago",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "6 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiTWs4eEFJdzF6MEFBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXN3QkNvd0JRVU5RZDJwcVVYSk1UR2N6VFhWNldtaDFhazFrVldSMlpGUlNYMVZOYVc5Qk0yaHNTMUpSWW1WYVNsOHRUSGhTUTNkUVRXOXBYM3BMYTFoUlFXczBVMDV3YmxwR1QybGhWblZJZVVzNFMxZERPRXBLWVZOaGJqbGxiVnBDUjBKeU1XaENZM0JsZG5GYWRuSkZkRk10VUU1S1dEUm5VM1ZNVWxCeFRFa3pWemhSYWpNdFNIVnFTM2h6ZFVZU0YybHdiMDlhVUU5WFJtSXpPV3RRU1ZCNFMwOHRaMEZyR2lKQlJsODJUVUZPYkZWc1VFZFllVWxoYzFSWlFYcHVkR3RrY2tOelYyTTFVRFpCIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfNiIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBvbiBWZW50dXJlRml6eiIsImxpbmsiOiJodHRwczovL3ZlbnR1cmVmaXp6LmNvbS9qb2JzL3NvZnR3YXJlLWVuZ2luZWVyLWF0LWF1cmEtMT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer - Intern (Asia)",
        "company_name": "Citadel",
        "location": "United States",
        "via": "via Citadel",
        "description": "Our engineers work in small teams to turn the best ideas into high-performing and resilient technology. With short development cycles, work rapidly goes into production. As an engineer, you can create systems architectures, develop platforms and build web frameworks. You’ll have access to state-of-the-art tools and apply innovative techniques including distributed computing, natural language... processing, machine learning and more.\n\nAs an intern, you’ll get to challenge the impossible in technology through an 11 week program that will allow you to collaborate and connect with senior team members. In addition, you’ll get the opportunity to network and socialize with peers throughout the internship.\n\nYour Objectives:\n• Create technological tools that bring trading strategies to life\n• Develop high-performance, large data research platforms\n• Work in small teams to build the future of finance\n\nYour Skills & Talents:\n• Degree in Computer Science, Computer Engineering or related fields (Bachelor’s, Master’s, PhD)\n• Exceptional programming and design skills\n• Strong analytical skills and familiarity with probability and statistics\n• Ability to communicate effectively in a collaborative, complex and highly technical team environment\n• Intellectual curiosity and passion for solving challenging problems using technology\n\nOpportunities available in Hong Kong and Singapore",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Degree in Computer Science, Computer Engineering or related fields (Bachelor’s, Master’s, PhD)",
                    "Exceptional programming and design skills",
                    "Strong analytical skills and familiarity with probability and statistics",
                    "Ability to communicate effectively in a collaborative, complex and highly technical team environment",
                    "Intellectual curiosity and passion for solving challenging problems using technology"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "As an engineer, you can create systems architectures, develop platforms and build web frameworks",
                    "As an intern, you’ll get to challenge the impossible in technology through an 11 week program that will allow you to collaborate and connect with senior team members",
                    "Create technological tools that bring trading strategies to life",
                    "Develop high-performance, large data research platforms",
                    "Work in small teams to build the future of finance"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "In addition, you’ll get the opportunity to network and socialize with peers throughout the internship"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.citadel.com/",
                "text": "citadel.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Citadel&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAII2gs",
                "text": "See web results for Citadel"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-NpKMlXwyH2YS29sH83vAI4cShUzG7IvScfWI&s=0",
        "extensions": [
            "1 day ago",
            "Internship"
        ],
        "detected_extensions": {
            "posted_at": "1 day ago",
            "schedule_type": "Internship"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIEludGVybiAoQXNpYSkiLCJodGlkb2NpZCI6IjVQMk9PTlVrazAwQUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkV2Y0JDcmNCUVVOUWQycHFVazVzVVRZME1GQkJSVXczUXpaYVltVlhaVlpxWjJVeGJYbHVVVmROVW5NMGNXTkJPR3BIZEZGdWFYcGthRW8yVlU4dE1EWkdOMnBJWW5Sd00zVlphbmRxT1MxUlIxZG5SRTVZY1dkeWIyeENhVGhRTmpKalEwRnpTMWxhUVRsWk4zRXlOR2MwT1V3eGFWVk9hMDl3T0RsNFVUQlZTa3hmZWkxaVQycGlUSHBTVFRCM1drNXVSMUE1VWsxbVQzZHFWV1pHZUhka05tdG9WVmx1UVVOcU5tdGtXa0ZpT1VGRVkwWTRXRWd3UVU1TkVoZHBjRzlQV2xCUFYwWmlNemxyVUVsUWVFdFBMV2RCYXhvaVFVWmZOazFCVG1KZlMwZFpVVFJwYjJocVJFeE1MVFJqTFZWSlowTkRNVTlpZHciLCJmY3YiOiIzIiwiZmNfaWQiOiJmY183IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIENpdGFkZWwiLCJsaW5rIjoiaHR0cHM6Ly93d3cuY2l0YWRlbC5jb20vY2FyZWVycy9kZXRhaWxzL3NvZnR3YXJlLWVuZ2luZWVyLWludGVybi1hc2lhLz91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Sr Staff Software Engineer (Kubernetes) *Remote*",
        "company_name": "GE",
        "location": "Anywhere",
        "via": "via GE Careers",
        "description": "Résumé de la description de poste\n\nÀ ce poste, vous êtes responsable de la conception de modules très complexes, de composants critiques ou d'une application/d'un produit complet dans son intégralité. Aspire à l'intégrer à plusieurs systèmes. À ce poste, vous travaillez de manière indépendante et vous êtes considéré comme un leader technique. À ce poste, vous êtes chargé de diriger les efforts de... conception et de développement liés à l'architecture, à l'évolutivité, à la disponibilité et aux performances, conformément à la feuille de route du produit/de l'application.\n\nDescription de l'emploi\n• Can be Remote\" (US)\n\nRoles and Responsibilities\n\n• Be responsible for providing technical leadership and defining, developing, and evolving software in a fast paced and agile development environment using the latest software development m and infrastructure\n• Provide guidance to developers with either planning and execution and/or design architecture using agile methodologies such as SCRUM\n• Work with Product Line Leaders (PLLs) to understand product requirements & vision\n• Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse\n• Capture system level requirements by brainstorming with CTO, Sr. Architects, Data Scientists, Businesses & Product Managers\n• Leads impact assessment and decision related to technology choices, design /architectural considerations and implementation strategy.\n• Subject matter expert in processes and methodologies with ability to adapt and improvise in various situations. Expert in navigating through ambiguity and prioritizing conflicting asks.\n• Expert level skills in design, architecture and development, with an ability to take a deep dive in the implementation aspects if the situation demands.\n• Leads the architecture and design efforts across the product / multiple product versions and is an expert in architecting custom solutions off the base product.\n• Expert in core data structures as well as algorithms and has the ability to implement them using language of choice when necessary – as a value offering.\n\nEducation Qualification\n\nBachelor's Degree in Computer Science or “STEM” Majors (Science, Technology, Engineering and Math) with minimum 8 years of experience.\n\nDesired Technical Expertise:\n• Facilitates and coaches software engineering team sessions on requirements estimation and alternative approaches to team sizing and estimation. Leads a community of practice around estimation to share best practices among teams\n• Knowledgeable about developments in UX in various contexts, businesses, and industries. Quantifies effectiveness of design choices by gathering data. Drives accountability and adoption. Publishes guidance and documentation to promote adoption of design. Proposes design solutions based on research and synthesis; creates general design principles that capture the vision and critical concerns for a program.\n• Demonstrates mastery of the intricacies of interactions and dynamics in Agile teams. Demonstrates advanced understanding of Lean Six Sigma principles (e.g., Black belt certified). Guides new teams to adopt Agile, troubleshoots adoption efforts, and guide continuous improvement. Provides training on Lean / Agile. Drives elimination of inefficiencies in coding process. Teaches XP practices to others. Actively embraces new methods and practices that increase efficiency and effectiveness.\n\nBusiness Acumen:\n• Evaluates technology to drive features and roadmaps. Maps technology trends to internal vision. Differentiates buzzwords from value proposition. Embraces technology trends that drive excellence beyond traditional practices (e.g., Test automation in lieu of traditional QA practices).\n• Balances value propositions for competing stakeholders. Recommends a well-researched recommendation of buy vs. build solution. Conveys the value proposition for the company by assessing financial risks and gains of decisions and return on investment (ROI). Manages the process of building and maintaining a successful alliance. Understands and successfully applies common analytical techniques, including ROI, SWOT, and Gap analyses. Able to clearly articulate the business drivers relevant to a given initiative.\n\nLeadership:\n• Influences through others; builds direct and \"behind the scenes\" support for ideas. Pre-emptively sees downstream consequences and effectively tailors influencing strategy to support a positive outcome. Uses experts or other third parties to influence.\n• Able to verbalize what is behind decisions and downstream implications. Continuously reflecting on success and failures to improve performance and decision-making. Understands when change is needed. Participates in technical strategy planning.\n• Proactively identifies and removes project obstacles or barriers on behalf of the team. Able to navigate accountability in a matrixed organization.\nCommunicates and demonstrates a shared sense of purpose. Learns from failure.\n\nPersonal Attributes:\n• Able to effectively direct and mentor others in critical thinking skills. Proactively engages with cross-functional teams to resolve issues and design solutions using critical thinking and analysis skills and best practices. Finds important patterns in seemingly unrelated information.\n• Influences and energizes other toward the common vision and goal. Maintains excitement for a process and drives to new directions of meeting the goal even when odds and setbacks render one path impassable.\n• Innovates and integrates new processes and/or technology to significantly add value to GE. Identifies how the cost of change weighs against the benefits and advises accordingly. Proactively learns new solutions and processes to address seemingly unanswerable problems.\n\nAdditional Information\n\nGE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law.\n\nThe salary range for this position is $136,000.00 - 204,000.00 USD Annual. The specific salary offered to a candidate may be influenced by a variety of factors including the candidate’s experience, their education, and the work location. In addition, this position is eligible for a performance bonus. Available benefits include be Health, Medical, 401K, Paid Leave.\n\n#LI-GF1\n\nDescription de l'emploi supplémentaire\n\nInformation additionnelle\n\nNiveau de rémunération\n\nSPB3\n\nGE offre un excellent environnement de travail, des possibilités d'évolution de carrière, une carrière stimulante et une rémunération concurrentielle. GE est un employeur garantissant l'égalité des chances. Les décisions en matière d'emploi sont prises sans distinction de race, de couleur, de religion, d'origine nationale ou ethnique, de sexe, d'orientation sexuelle, d'identité ou d'expression de genre, d'âge, de handicap, de statut de vétéran protégé ou d'autres caractéristiques protégées par la loi.\n\nGE n'emploiera seulement ceux qui sont légalement autorisés à travailler aux États-Unis pour ce poste.\n\nAide à la relocalisation fournie : Non",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "Expert in navigating through ambiguity and prioritizing conflicting asks",
                    "Expert level skills in design, architecture and development, with an ability to take a deep dive in the implementation aspects if the situation demands",
                    "Bachelor's Degree in Computer Science or “STEM” Majors (Science, Technology, Engineering and Math) with minimum 8 years of experience",
                    "Demonstrates advanced understanding of Lean Six Sigma principles (e.g., Black belt certified)",
                    "Recommends a well-researched recommendation of buy vs. build solution",
                    "Able to clearly articulate the business drivers relevant to a given initiative",
                    "Continuously reflecting on success and failures to improve performance and decision-making",
                    "Able to effectively direct and mentor others in critical thinking skills"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "À ce poste, vous êtes responsable de la conception de modules très complexes, de composants critiques ou d'une application/d'un produit complet dans son intégralité",
                    "À ce poste, vous êtes chargé de diriger les efforts de conception et de développement liés à l'architecture, à l'évolutivité, à la disponibilité et aux performances, conformément à la feuille de route du produit/de l'application",
                    "Be responsible for providing technical leadership and defining, developing, and evolving software in a fast paced and agile development environment using the latest software development m and infrastructure",
                    "Provide guidance to developers with either planning and execution and/or design architecture using agile methodologies such as SCRUM",
                    "Work with Product Line Leaders (PLLs) to understand product requirements & vision",
                    "Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse",
                    "Capture system level requirements by brainstorming with CTO, Sr",
                    "Leads impact assessment and decision related to technology choices, design /architectural considerations and implementation strategy",
                    "Facilitates and coaches software engineering team sessions on requirements estimation and alternative approaches to team sizing and estimation",
                    "Leads a community of practice around estimation to share best practices among teams",
                    "Drives accountability and adoption",
                    "Publishes guidance and documentation to promote adoption of design",
                    "Proposes design solutions based on research and synthesis; creates general design principles that capture the vision and critical concerns for a program",
                    "Demonstrates mastery of the intricacies of interactions and dynamics in Agile teams",
                    "Guides new teams to adopt Agile, troubleshoots adoption efforts, and guide continuous improvement",
                    "Provides training on Lean / Agile",
                    "Drives elimination of inefficiencies in coding process",
                    "Teaches XP practices to others",
                    "Actively embraces new methods and practices that increase efficiency and effectiveness",
                    "Evaluates technology to drive features and roadmaps",
                    "Embraces technology trends that drive excellence beyond traditional practices (e.g., Test automation in lieu of traditional QA practices)",
                    "Balances value propositions for competing stakeholders",
                    "Conveys the value proposition for the company by assessing financial risks and gains of decisions and return on investment (ROI)",
                    "Manages the process of building and maintaining a successful alliance",
                    "Influences through others; builds direct and \"behind the scenes\" support for ideas",
                    "Pre-emptively sees downstream consequences and effectively tailors influencing strategy to support a positive outcome",
                    "Uses experts or other third parties to influence",
                    "Participates in technical strategy planning",
                    "Proactively identifies and removes project obstacles or barriers on behalf of the team",
                    "Proactively engages with cross-functional teams to resolve issues and design solutions using critical thinking and analysis skills and best practices",
                    "Maintains excitement for a process and drives to new directions of meeting the goal even when odds and setbacks render one path impassable",
                    "Innovates and integrates new processes and/or technology to significantly add value to GE",
                    "Identifies how the cost of change weighs against the benefits and advises accordingly",
                    "Proactively learns new solutions and processes to address seemingly unanswerable problems"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "The salary range for this position is $136,000.00 - 204,000.00 USD Annual",
                    "The specific salary offered to a candidate may be influenced by a variety of factors including the candidate’s experience, their education, and the work location",
                    "In addition, this position is eligible for a performance bonus",
                    "Available benefits include be Health, Medical, 401K, Paid Leave"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.ge.com/",
                "text": "ge.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=GE&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIIoAw",
                "text": "See web results for GE"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQrtAJDObNslOdEZZ1bEOFNL8RmGg87D7K6Llme&s=0",
        "extensions": [
            "7 days ago",
            "Work from home",
            "Full-time",
            "Health insurance",
            "Dental insurance"
        ],
        "detected_extensions": {
            "posted_at": "7 days ago",
            "schedule_type": "Full-time",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTciBTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAoS3ViZXJuZXRlcykgKlJlbW90ZSoiLCJodGlkb2NpZCI6IkVGakp0b2h4Y2U4QUFBQUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3IiwiZ2wiOiJ1cyIsImhsIjoiZW4iLCJmYyI6IkVvd0NDc3dCUVVOUWQycHFWSGRpTW5kM2NUbEJhR05WWmxZeFRWbGhka0p4VUhKU2FucFdjVU5aVERrM1pXdHFjM2hqYlhOeE5uWTNSazlZUjNSV00xUm1SSFE0WldoVmRUUXRjMHA0UTJoRE56WklWVTl1TnkwM1JrVk9SVmRQYlRRNVNYQkJVVlprTlhWQ1YzUnJiVlo0WW5VM1pXVjFabGhYZDJvM1RFcG9hblJhZDJsNFJqRnVkMVZTYWtOTU9XZzFWVFZ4ZFRBeE1FVnFWR3hLUWtaM1dGVlRRMUI2ZERCVE9Yb3piRXhEZGpFemRsUkliUzFDWDFwTVdIb3pjR0UwVEV3NVdqQlVURmN0U1RRMFgyVlRFaGRwY0c5UFdsQlBWMFppTXpsclVFbFFlRXRQTFdkQmF4b2lRVVpmTmsxQlRrSXpXRTlUTjNSZllXRkdlVjl2VVVkbGJXOUxTbTgxZFZWMlVRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfOSIsImFwcGx5X2xpbmsiOnsidGl0bGUiOiJBcHBseSBkaXJlY3RseSBvbiBHRSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vam9icy5nZWNhcmVlcnMuY29tL2ZyL2ZyL2pvYi9SMzY5ODEzMC9Tci1TdGFmZi1Tb2Z0d2FyZS1FbmdpbmVlci1LdWJlcm5ldGVzLVJlbW90ZT91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer - Tech Lead(.Net)",
        "company_name": "UPMC",
        "location": "United States",
        "via": "via UPMC - Careers",
        "description": "Description\n\nPurpose...\n\nWe are looking for a Full-stack .NET Lead Developer to join the Core Systems team under App Engineering Department in UPMC Payer Application to lead the effort of architecting, designing, developing, and enhancing various application(s) (from scratch or an existing) to support the UPMC HealthPlan business. An ideal candidate should be a self-starter, have a deep understanding of the technologies outlined below, and be willing/capable to help/lead to address issues across multiple teams/technologies. 100% Work from Home Opportunity!!\n\nAn ideal candidate should be a self-starter, have a deep understanding of the technologies outlined below, and be willing/capable to help/lead to address issues across multiple teams/technologies.\n\nResponsibilities:\n• Project Management - Responsible For time tracking and updating documentation. Plan and lead projects, including staff coordination. Collaborate with other technical teams, as appropriate, for successful completion of projects. Lead POC Evaluations.\n• Security - Validate and review secure processes and protocols. Ensure that processes/protocols are followed by junior level staff.\n• Application Development Cycle - Show the ability to define how to use different SDLCs. Establish process around SDLCs.\n• Design - Implement the overall system design. Exhibit awareness of user experience standards.\n• Interactions with Others - Successfully completes projects, tasks, and initiatives by embracing a team-first approach. Works in collaboration with team and offers feedback, where appropriate, to complete individual and group efforts. Shows the ability to adjust and be flexible to change by adapting approach when necessary. Mentors less experienced staff.\n• Troubleshooting - Solve multiple issues concurrently. Coordinate, delegate, and mentor less experienced staff with issue resolution.\n• Self Development - Responsible for continuous self-study, trainings, partnering with management and more senior members of team, and/or seeking out opportunities to broaden scope to stay up to date with industry and organizational trends. Seeks feedback from management and more senior team members for development and effectively incorporates feedback into work and behaviors.\n• Documentation - Create detail-oriented documentation that outlines new and moderately complex processes. Responsible for quality and validity of documentation.\n• Quality - Demonstrate the ability to conduct code review of others.\n• Communication - Responsible for demonstrating appropriate, clear, concise, and effective written and oral communications in all interactions to build relationships and accomplish day to day work and projects.\n• Integration - Responsible for more complex integration between modules.\n\nQualifications\n• Typically has 7+ years of related work experience in .NET, C#, and Microsoft server-side technologies.\n• In-depth experience with AngularJS version 2-7, TypeScript, HTML, CSS, JavaScript, jQuery, bootstrap\n• Capable of designing and consuming REST APIs\n• Strong experience with SQL Server and T-SQL\n• Experience with source control systems such as TFS/VSTS (Azure DevOps), SVN, or Git\n• Holds Mastery across different technology domains and has a background in recommending, implementing, and coordinating architectural approaches\n• Experience working in Agile/Scrum and Waterfall development methodology\n• Experience leading team(s) of technical resources\n• Ability to lead and collaborate with cross-functional teams to deliver project goals related to developing cross-functional systems.\n• Ability to lead the design and development of complex solutions that meet requirements within the timeline focusing on quality.\n• Deep understanding/experience of the object-oriented concepts, design patterns, clean coding, code refactoring, code review practices, and experience creating automated unit tests.\n• Experience with complex development environments, taking abstract concepts and ideas and formulating a detailed software deliverable.\n\nPreferred Skills:\n• Prior Healthcare domain experience\n• Deep understanding of.NET Core, Entity Framework Core\n• ASP.NET WebAPI experience\n• Microsoft Azure or related cloud experience\n• Experience with NoSQL databases and database concepts\n• Experience in Node.JS\n• Experience in SAFe\n\nAcademic Qualification: Bachelor’s in Computer Science, Engineering, Mathematics, or a related field\n\nWe encourage you to apply for this position if you are a diplomatic team player/lead, creative thinker, problem solver, passionate to work in the .NET framework, and ready to follow UPMC Values including ‘Dignity and Respect\n\n100% WORK FROM HOME OPPORTUNITY!!\n\nLicensure, Certifications, and Clearances:\n\nUPMC is an Equal Opportunity Employer/Disability/Veteran",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "An ideal candidate should be a self-starter, have a deep understanding of the technologies outlined below, and be willing/capable to help/lead to address issues across multiple teams/technologies",
                    "Typically has 7+ years of related work experience in .NET, C#, and Microsoft server-side technologies",
                    "In-depth experience with AngularJS version 2-7, TypeScript, HTML, CSS, JavaScript, jQuery, bootstrap",
                    "Capable of designing and consuming REST APIs",
                    "Strong experience with SQL Server and T-SQL",
                    "Experience with source control systems such as TFS/VSTS (Azure DevOps), SVN, or Git",
                    "Holds Mastery across different technology domains and has a background in recommending, implementing, and coordinating architectural approaches",
                    "Experience working in Agile/Scrum and Waterfall development methodology",
                    "Experience leading team(s) of technical resources",
                    "Ability to lead and collaborate with cross-functional teams to deliver project goals related to developing cross-functional systems",
                    "Ability to lead the design and development of complex solutions that meet requirements within the timeline focusing on quality",
                    "Deep understanding/experience of the object-oriented concepts, design patterns, clean coding, code refactoring, code review practices, and experience creating automated unit tests",
                    "Experience with complex development environments, taking abstract concepts and ideas and formulating a detailed software deliverable",
                    "NET WebAPI experience",
                    "Microsoft Azure or related cloud experience",
                    "Experience with NoSQL databases and database concepts",
                    "Experience in Node.JS",
                    "Experience in SAFe",
                    "Academic Qualification: Bachelor’s in Computer Science, Engineering, Mathematics, or a related field",
                    "We encourage you to apply for this position if you are a diplomatic team player/lead, creative thinker, problem solver, passionate to work in the .NET framework, and ready to follow UPMC Values including ‘Dignity and Respect"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "Project Management - Responsible For time tracking and updating documentation",
                    "Plan and lead projects, including staff coordination",
                    "Collaborate with other technical teams, as appropriate, for successful completion of projects",
                    "Lead POC Evaluations",
                    "Security - Validate and review secure processes and protocols",
                    "Ensure that processes/protocols are followed by junior level staff",
                    "Application Development Cycle - Show the ability to define how to use different SDLCs",
                    "Establish process around SDLCs",
                    "Design - Implement the overall system design",
                    "Exhibit awareness of user experience standards",
                    "Interactions with Others - Successfully completes projects, tasks, and initiatives by embracing a team-first approach",
                    "Works in collaboration with team and offers feedback, where appropriate, to complete individual and group efforts",
                    "Shows the ability to adjust and be flexible to change by adapting approach when necessary",
                    "Coordinate, delegate, and mentor less experienced staff with issue resolution",
                    "Self Development - Responsible for continuous self-study, trainings, partnering with management and more senior members of team, and/or seeking out opportunities to broaden scope to stay up to date with industry and organizational trends",
                    "Seeks feedback from management and more senior team members for development and effectively incorporates feedback into work and behaviors",
                    "Documentation - Create detail-oriented documentation that outlines new and moderately complex processes",
                    "Responsible for quality and validity of documentation",
                    "Quality - Demonstrate the ability to conduct code review of others",
                    "Communication - Responsible for demonstrating appropriate, clear, concise, and effective written and oral communications in all interactions to build relationships and accomplish day to day work and projects",
                    "Integration - Responsible for more complex integration between modules"
                ]
            }
        ],
        "related_links": [
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=UPMC&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAII5ww",
                "text": "See web results for UPMC"
            }
        ],
        "extensions": [
            "11 days ago",
            "56.67–92.33 an hour",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "11 days ago",
            "schedule_type": "Full-time",
            "salary": "56.67–92.33 an hour"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIFRlY2ggTGVhZCguTmV0KSIsImh0aWRvY2lkIjoiU3hHN3dDS2YzWWNBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVVtWlNkRkU0T0dFeVpsQTVhbmd4WWtSa2FHNXRNRXAxV1hCd05VSkJlamRwUlRCSGRqTTVSWGcwY3pOM1NXcE9PRVptWTBOUlNscFhUVmhPYkY5SU0xaDNjMGxXVWtGSVZFaHBWVTlxYUZKSloxSktaRlJST0Rob1QzazJSRFZGVW1sbVNFTlhZblJyWWpaZlVFNTJja2N6T0UxVFgwaHFSMFV4VjJOa2MyRjRaelpEYlVWcVdVcG5VbXhQVG1Wa2FrMVRSRzVTUmpGeFpFVXlTMDg1Tm5KcVNHaDNTak5tU2s5aWQyNU9ZVXhaRWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUbWh0UVhkQ2FrMTZSRTF2VGtKVGNrOXpjRFZEV1dwVk1GcG1VUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzExIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFVQTUMgLSBDYXJlZXJzIiwibGluayI6Imh0dHBzOi8vY2FyZWVycy51cG1jLmNvbS9qb2JzLzExOTU3MzU5LXNvZnR3YXJlLWVuZ2luZWVyLXRlY2gtbGVhZC1kb3QtbmV0P3V0bV9jYW1wYWlnbj1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9zb3VyY2U9Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fbWVkaXVtPW9yZ2FuaWMifX0="
    },
    {
        "title": "Lead Golang Software Engineer",
        "company_name": "Consensys",
        "location": "Anywhere",
        "via": "via Startup Jobs",
        "description": "Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on\n\nWorking with ConsenSys puts you at the forefront of an evolving paradigm, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society...\n\nBlockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users.\n\nYou’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game. You’ll join a network of entrepreneurs and technologists that reaches the edge of our ecosystem. ConsenSys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.\n\nKey Responsibilities:We are seeking a highly experienced Lead Golang Software Engineer to join our team. The ideal candidate will have expertise in Golang and experience building scalable systems as affinity for cryptography and mathematics.\n\n• Design, develop and maintain scalable systems using Golang\n• Work on zkEVM Prover implementation and integration\n• Lead a team of software engineers and take ownership of the technical direction of the project\n• Participate in all aspects of the software development process, including requirements gathering, analysis, design, implementation, and testing\n• Troubleshoot and resolve issues that arise during development\n• Stay current with new technologies and industry trends related to zkEVM Prover\n\nQualifications:• Strong experience with Golang and building scalable systems\n• Experience with zkEVM Prover, including implementation and integration\n• Strong experience leading a team of software engineers\n• Experience with agile development methodologies\n• Strong problem-solving and analytical skills\n• Excellent communication and teamwork abilities\n• Bachelor's degree in Computer Science or a related field\n• Experience with other languages and technologies such as Solidity, Rust or Java is a plus\n\nDon't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.\n\nThe salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills. Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $USD[$176,000 - $366,000]\n\nConsenSys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. ConsenSys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "The ideal candidate will have expertise in Golang and experience building scalable systems as affinity for cryptography and mathematics",
                    "Design, develop and maintain scalable systems using Golang",
                    "Stay current with new technologies and industry trends related to zkEVM Prover",
                    "Qualifications:• Strong experience with Golang and building scalable systems",
                    "Experience with zkEVM Prover, including implementation and integration",
                    "Strong experience leading a team of software engineers",
                    "Experience with agile development methodologies",
                    "Strong problem-solving and analytical skills",
                    "Excellent communication and teamwork abilities",
                    "Bachelor's degree in Computer Science or a related field"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the top of your game",
                    "Lead a team of software engineers and take ownership of the technical direction of the project",
                    "Participate in all aspects of the software development process, including requirements gathering, analysis, design, implementation, and testing",
                    "Troubleshoot and resolve issues that arise during development"
                ]
            },
            {
                "title": "Benefits",
                "items": [
                    "Candidates should anticipate a base salary (not including bonus, equity or other benefits) of $USD[$176,000 - $366,000]"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://consensys.net/",
                "text": "consensys.net"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Consensys&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIIqQ0",
                "text": "See web results for Consensys"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR4MvkfgxR_7HiRp53jkXgN8T19vkOJJVmI0f-8ZV4&s",
        "extensions": [
            "6 days ago",
            "Work from home",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "6 days ago",
            "schedule_type": "Full-time",
            "work_from_home": true
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJMZWFkIEdvbGFuZyBTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiQ09DZGtjLXVQMGtBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVZHWmxhV1JQTWtkVFNsOVllbTgwZFc4d2FqVXdTalJXVmtKT056WjBTM1pyVFU1MVFXczBiM0pwTW5OcGFEZDRRVGhEYWxoRk9GUXpRVXRvZFdSbk5tSkZXV2czUnpscWFVbFpZM2RuY21WTFNteEpiWGRUUTFOSWMyWmxSSGhUTlZwWGVFazNXRU5QVGs1TlRFdEdVemRzUTNkVGFYQTFTMHRLVUMxbmFXMVBRV3hCTUcxSWVXbG9iVmRVWTJsbVlWRmlUMjl1TVVoSGJHdFpXRE5HTUZrd1VYbE9WRE00VG5oaFJWOU1WbGN3RWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUbm8xV1hWWGJ6TlRObUZuTlRWdmNXNVNhVEY2VDJ3MVJVTjFadyIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzEzIiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIFN0YXJ0dXAgSm9icyIsImxpbmsiOiJodHRwczovL3N0YXJ0dXAuam9icy9sZWFkLWdvbGFuZy1zb2Z0d2FyZS1lbmdpbmVlci1jb25zZW5zeXMtNDIzNTI3Nj91dG1fY2FtcGFpZ249Z29vZ2xlX2pvYnNfYXBwbHlcdTAwMjZ1dG1fc291cmNlPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX21lZGl1bT1vcmdhbmljIn19"
    },
    {
        "title": "Software Engineer - Link Success",
        "company_name": "Plaid",
        "location": "United States",
        "via": "via Lever",
        "description": "We believe that the way people interact with their finances will drastically improve in the next few years. We’re dedicated to empowering this transformation by building the tools and experiences that thousands of developers use to create their own products. Plaid powers the tools millions of people rely on to live a healthier financial life. We work with thousands of companies like Venmo, SoFi... several of the Fortune 500, and many of the largest banks to make it easy for people to connect their financial accounts to the apps and services they want to use. Plaid’s network covers 12,000 financial institutions across the US, Canada, UK and Europe. Founded in 2013, the company is headquartered in San Francisco with offices in New York, Salt Lake City, Washington D.C., London and Amsterdam. #LI-Remote\n\nLink is how millions of users interact with Plaid, and is a critical component for some of the most popular apps in the world. We improve and optimize Link to help even more users successfully connect to their financial institutions.\n\nOn Link Success, you will work across the frontend and backend of Plaid Link to design and ship new features at scale. You will often explore our data, ideate your own hypotheses on how to help more users connect with Link, and run experiments to validate hypotheses. Some past major wins from our team include intelligently personalizing the list of institutions shown in Link, optimizing the authentication process for returning users to Plaid, and countless UI tweaks that all resulted in improved conversion.\n\nSince Link is used by every Plaid customer, you will directly improve the experience of users across hundreds of the most popular fintech apps. Your work will also have a clear impact on Plaid’s business: every increase in our conversion rate increases our overall revenue.\n\nWhat excites you\n• Identifying new product and technical opportunities, and owning them through to completion.\n• Help to work across the frontend and backend of Plaid Link to design and ship new features at scale.\n• Be part of influencing the experience of users across hundreds of most popular fintech apps.\n• Exploring our product data to find new insights.\n\nWhat excites us\n• +1 years of Full-Stack Engineering experience.\n• Technical generalists who enjoy working in different parts of the stack to solve problems in service of our customers and their users.\n• Product-minded engineers who advocate for a better and more inclusive user experience on behalf of our users.\n• Nice to have: prior work with growth-centric or experimentation-driven teams.\n\n#LI-Remote\n\nPlaid is proud to be an equal opportunity employer and values diversity at our company. We do not discriminate based on race, color, national origin, ethnicity, religion or religious belief, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, military or veteran status, disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state, and local laws. Plaid is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance with your application or interviews due to a disability, please let us know at accommodations@plaid.com.\n\nPlease review our Candidate Privacy Notice here",
        "job_highlights": [
            {
                "title": "Qualifications",
                "items": [
                    "+1 years of Full-Stack Engineering experience",
                    "Technical generalists who enjoy working in different parts of the stack to solve problems in service of our customers and their users",
                    "Nice to have: prior work with growth-centric or experimentation-driven teams"
                ]
            },
            {
                "title": "Responsibilities",
                "items": [
                    "On Link Success, you will work across the frontend and backend of Plaid Link to design and ship new features at scale",
                    "You will often explore our data, ideate your own hypotheses on how to help more users connect with Link, and run experiments to validate hypotheses",
                    "Identifying new product and technical opportunities, and owning them through to completion",
                    "Be part of influencing the experience of users across hundreds of most popular fintech apps"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.plaid.com/",
                "text": "plaid.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Plaid&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAII6A0",
                "text": "See web results for Plaid"
            }
        ],
        "extensions": [
            "26 days ago",
            "Full-time",
            "No degree mentioned"
        ],
        "detected_extensions": {
            "posted_at": "26 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAtIExpbmsgU3VjY2VzcyIsImh0aWRvY2lkIjoiZ1RydHotcFR1dklBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXZjQkNyY0JRVU5RZDJwcVZHaHpaamMwUld4NWQzSk5NbFl5UjE5MVIxQnBURk5PVUcxR2RtOWFSMmRNWjFaT09HZHRUVXR2VTBKT01tUmZjVUpsTFRJeFdHeHNkbE51TjA1aE5uSlhiSHBwYVRCTE5qZDJOSE5wTUhGVk0wdEllbXc1UW1SRVJsbEhkV1ZMTmpaNk1tZ3lVMWhOVFhoT1J5MUNZMWxRUzFka05YRllaWGR3UzFCV1pWZENkRXBRVFRaelRGQnNNbWgyUjI1alRFTkxTRTFJYVdoM1NrdDRhVW93T1ZseWJHaHRjSFF0V210Q2FpMXZaVTVCRWhkcGNHOVBXbEJQVjBaaU16bHJVRWxRZUV0UExXZEJheG9pUVVaZk5rMUJUMFZQYzBGMFRsY3dhbkZOZFVKUllUZ3hZVUpsZVdSbGRHYzNRUSIsImZjdiI6IjMiLCJmY19pZCI6ImZjXzE1IiwiYXBwbHlfbGluayI6eyJ0aXRsZSI6IkFwcGx5IG9uIExldmVyIiwibGluayI6Imh0dHBzOi8vam9icy5sZXZlci5jby9wbGFpZC85OWEwNjkwZi05ZGMwLTRkMWMtOTJlYy0zYzk2MTFmMTllYzE/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    },
    {
        "title": "Software Engineer",
        "company_name": "Lowes",
        "location": "Missouri",
        "via": "via Lowe's Careers",
        "description": "Job Summary: The primary purpose of this role is to translate business requirements and functional specifications into logical program designs and to deliver code modules, stable application systems, and software solutions. This includes developing, configuring, or modifying integrated business and/or enterprise application solutions within various computing environments. This role facilitates the implementation and maintenance of business and enterprise software solutions to ensure successful deployment of released applications.\n\nKey Responsibilities: • Translates business requirements and specifications into logical program designs, code modules, stable application systems, and software solutions with occasional guidance from senior colleagues; partners with Product Team to understand business needs and functional specifications • Develops, configures, or modifies integrated business and/or enterprise application solutions within various computing environments by designing and... coding component-based applications using various programming languages • Conducts the implementation and maintenance of complex business and enterprise software solutions to ensure successful deployment of released applications • Supports systems integration testing (SIT) and user acceptance testing (UAT), provides insight into defining test plans, and ensures quality software deployment • Participates in the end-to-end product lifecycle by applying and sharing an in-depth understanding of company and industry methodologies, policies, standards, and controls • Understands Computer Science and/or Computer Engineering fundamentals; knows software architecture and readily applies this to software solutions • Automates and simplifies team development, test, and operations processes; develops conceptual, logical and physical architectures consisting of one or more viewpoints (business, application, data, and infrastructure) required for business solution delivery • Solves difficult technical problems; solutions are testable, maintainable, and efficient\n\nMinimum Qualifications: • Bachelor's degree in Computer Science, CIS, or related field (or equivalent work experience in a related field) • 2 years of experience in software development or a related field • 2 years of experience in database technologies • 1 year of experience working on project(s) involving the implementation of solutions applying development life cycles (SDLC)\n\nPreferred Qualifications: • Master's degree in Computer Science, CIS, or related field • 2 years of IT experience developing and implementing business systems within an organization • 4 years of experience working with defect or incident tracking software • 4 years of experience with technical documentation in a software development environment • 2 years of experience working with an IT Infrastructure Library (ITIL) framework • 2 years of experience leading teams, with or without direct reports • Experience with application and integration middleware • Experience with database technologies\n\nAbout Lowe’s: Lowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 19 million customer transactions a week in the United States and Canada. With fiscal year 2021 sales of over $96 billion, Lowe’s and its related businesses operate or service nearly 2,200 home improvement and hardware stores and employ over 300,000 associates. Based in Mooresville, N.C., Lowe’s supports the communities it serves through programs focused on creating safe, affordable housing and helping to develop the next generation of skilled trade experts. For more information, visit Lowes.com.\n\nEEO Statement\nLowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law",
        "job_highlights": [
            {
                "items": [
                    "Job Summary: The primary purpose of this role is to translate business requirements and functional specifications into logical program designs and to deliver code modules, stable application systems, and software solutions. This includes developing, configuring, or modifying integrated business and/or enterprise application solutions within various computing environments. This role facilitates the implementation and maintenance of business and enterprise software solutions to ensure successful deployment of released applications.\n\nKey Responsibilities: • Translates business requirements and specifications into logical program designs, code modules, stable application systems, and software solutions with occasional guidance from senior colleagues; partners with Product Team to understand business needs and functional specifications • Develops, configures, or modifies integrated business and/or enterprise application solutions within various computing environments by designing and... coding component-based applications using various programming languages • Conducts the implementation and maintenance of complex business and enterprise software solutions to ensure successful deployment of released applications • Supports systems integration testing (SIT) and user acceptance testing (UAT), provides insight into defining test plans, and ensures quality software deployment • Participates in the end-to-end product lifecycle by applying and sharing an in-depth understanding of company and industry methodologies, policies, standards, and controls • Understands Computer Science and/or Computer Engineering fundamentals; knows software architecture and readily applies this to software solutions • Automates and simplifies team development, test, and operations processes; develops conceptual, logical and physical architectures consisting of one or more viewpoints (business, application, data, and infrastructure) required for business solution delivery • Solves difficult technical problems; solutions are testable, maintainable, and efficient\n\nMinimum Qualifications: • Bachelor's degree in Computer Science, CIS, or related field (or equivalent work experience in a related field) • 2 years of experience in software development or a related field • 2 years of experience in database technologies • 1 year of experience working on project(s) involving the implementation of solutions applying development life cycles (SDLC)\n\nPreferred Qualifications: • Master's degree in Computer Science, CIS, or related field • 2 years of IT experience developing and implementing business systems within an organization • 4 years of experience working with defect or incident tracking software • 4 years of experience with technical documentation in a software development environment • 2 years of experience working with an IT Infrastructure Library (ITIL) framework • 2 years of experience leading teams, with or without direct reports • Experience with application and integration middleware • Experience with database technologies\n\nAbout Lowe’s: Lowe’s Companies, Inc. (NYSE: LOW) is a FORTUNE® 50 home improvement company serving approximately 19 million customer transactions a week in the United States and Canada. With fiscal year 2021 sales of over $96 billion, Lowe’s and its related businesses operate or service nearly 2,200 home improvement and hardware stores and employ over 300,000 associates. Based in Mooresville, N.C., Lowe’s supports the communities it serves through programs focused on creating safe, affordable housing and helping to develop the next generation of skilled trade experts. For more information, visit Lowes.com.\n\nEEO Statement\nLowe’s is an equal opportunity employer and administers all personnel practices without regard to race, color, religious creed, sex, gender, age, ancestry, national origin, mental or physical disability or medical condition, sexual orientation, gender identity or expression, marital status, military or veteran status, genetic information, or any other category protected under federal, state, or local law"
                ]
            }
        ],
        "related_links": [
            {
                "link": "http://www.lowes.com/",
                "text": "lowes.com"
            },
            {
                "link": "https://www.google.com/search?hl=en&gl=us&q=Lowes&sa=X&ved=0ahUKEwjzg-as_df9AhW9PkQIHcSRD5A4ChCYkAIIlw4",
                "text": "See web results for Lowes"
            }
        ],
        "thumbnail": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRkzuN7M0pPUxDG0B6_5Ym5GJF-cIHJz2Hch0er&s=0",
        "extensions": [
            "5 days ago",
            "Full-time"
        ],
        "detected_extensions": {
            "posted_at": "5 days ago",
            "schedule_type": "Full-time"
        },
        "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImh0aWRvY2lkIjoiTWt0a3RfRDlLSTBBQUFBQUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3ciLCJnbCI6InVzIiwiaGwiOiJlbiIsImZjIjoiRXVJQkNxSUJRVU5RZDJwcVVWTjJVVWxPTlVSQk5HRXdNMGsyVm10NVRXc3RVVGhYU1ZaM1ptRTNiemxmWDNaUmNFUXhVRk52V1ZSUlZFcFZWako1VW1kaFZFTjRkbGRNY2psNmJWSjFaMWxwZDJrMWNuZG9VV293YmxNNVNWZ3piR2N6UVhvMmJVbGFhRmhwTW01b2RpMTFXRVU1WjNsSGJWRkpOM3AzWTBjd2NHeHVSMkl5VWt0dFdHd3lZakZLY2tKSk5ucHNOMnhTY1RjMFZGbGlUbTVXVGxwTGFXTkJFaGRwY0c5UFdsQlBWMFppTXpsclVFbFFlRXRQTFdkQmF4b2lRVVpmTmsxQlRucFVNRlp3VTFaVVNqVmFWbFV5VjI5elZ6ZHhNa3RwTnpOcFFRIiwiZmN2IjoiMyIsImZjX2lkIjoiZmNfMTciLCJhcHBseV9saW5rIjp7InRpdGxlIjoiQXBwbHkgZGlyZWN0bHkgb24gTG93ZSdzIENhcmVlcnMiLCJsaW5rIjoiaHR0cHM6Ly90YWxlbnQubG93ZXMuY29tL3VzL2VuL2pvYi9MT1dFVVMyMzIzOTgyQlJFWFRFUk5BTEVOVVMvU29mdHdhcmUtRW5naW5lZXI/dXRtX2NhbXBhaWduPWdvb2dsZV9qb2JzX2FwcGx5XHUwMDI2dXRtX3NvdXJjZT1nb29nbGVfam9ic19hcHBseVx1MDAyNnV0bV9tZWRpdW09b3JnYW5pYyJ9fQ=="
    }
]